ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/**
  **************************************************************************
  * @file     at32f435_437cx.h
  * @author   Artery Technology & HorrorTroll & Zhaqian & Maxjta
  * @brief    at32f435_437cx header file
  **************************************************************************
  *                       Copyright notice & Disclaimer
  *
  * The software Board Support Package (BSP) that is made available to
  * download from Artery official website is the copyrighted work of Artery.
  * Artery authorizes customers to use, copy, and distribute the BSP
  * software and its related documentation for the purpose of design and
  * development in conjunction with Artery microcontrollers. Use of the
  * software is governed by this copyright notice and the following disclaimer.
  *
  * THIS SOFTWARE IS PROVIDED ON "AS IS" BASIS WITHOUT WARRANTIES,
  * GUARANTEES OR REPRESENTATIONS OF ANY KIND. ARTERY EXPRESSLY DISCLAIMS,
  * TO THE FULLEST EXTENT PERMITTED BY LAW, ALL EXPRESS, IMPLIED OR
  * STATUTORY OR OTHER WARRANTIES, GUARANTEES OR REPRESENTATIONS,
  * INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT.
  *
  **************************************************************************
  */
/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup AT32F435_437cx
  * @{
  */

#ifndef __AT32F435_437Cx_H
#define __AT32F435_437Cx_H

#ifdef __cplusplus
extern "C" {
#endif

/**
  * @brief at32f435_437 standard peripheral library version number
  */
 #define __AT32F435_437_LIBRARY_VERSION_MAJOR    (0x02) /*!< [31:24] major version */
 #define __AT32F435_437_LIBRARY_VERSION_MIDDLE   (0x02) /*!< [23:16] middle version */
 #define __AT32F435_437_LIBRARY_VERSION_MINOR    (0x02) /*!< [15:8]  minor version */
 #define __AT32F435_437_LIBRARY_VERSION_RC       (0x00) /*!< [7:0]  release candidate */
 #define __AT32F435_437_LIBRARY_VERSION          ((__AT32F435_437_LIBRARY_VERSION_MAJOR << 24)  | \
                                                  (__AT32F435_437_LIBRARY_VERSION_MIDDLE << 16) | \
                                                  (__AT32F435_437_LIBRARY_VERSION_MINOR << 8)   | \
                                                  (__AT32F435_437_LIBRARY_VERSION_RC))
/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */

/**
  * @brief Configuration of the Cortex-M4 Processor and Core Peripherals
 */
#define __CM4_REV                  0x0001U  /*!< Core Revision r0p1                           */
#define __MPU_PRESENT              1U       /*!< AT32 devices provide an MPU                  */
#define __NVIC_PRIO_BITS           4U       /*!< AT32 uses 4 Bits for the Priority Levels     */
#define __Vendor_SysTickConfig     0U       /*!< Set to 1 if different SysTick Config is used */
#define __FPU_PRESENT              1U       /*!< AT32 devices provide an FPU                  */

/**
  * @}
  */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */
/**
  * @brief at32f435_437 interrupt number definition, according to the selected device
  *        in @ref library_configuration_section
  */
 typedef enum IRQn
 {
     /******  cortex-m4 processor exceptions numbers ***************************************************/
     Reset_IRQn                  = -15,    /*!< 1 reset vector, invoked on power up and warm reset   */
     NonMaskableInt_IRQn         = -14,    /*!< 2 non maskable interrupt                             */
     HardFault_IRQn              = -13,    /*!< 3 hard fault, all classes of fault                   */
     MemoryManagement_IRQn       = -12,    /*!< 4 cortex-m4 memory management interrupt              */
     BusFault_IRQn               = -11,    /*!< 5 cortex-m4 bus fault interrupt                      */
     UsageFault_IRQn             = -10,    /*!< 6 cortex-m4 usage fault interrupt                    */
     SVCall_IRQn                 = -5,     /*!< 11 cortex-m4 sv call interrupt                       */
     DebugMonitor_IRQn           = -4,     /*!< 12 cortex-m4 debug monitor interrupt                 */
     PendSV_IRQn                 = -2,     /*!< 14 cortex-m4 pend sv interrupt                       */
     SysTick_IRQn                = -1,     /*!< 15 cortex-m4 system tick interrupt                   */
 
     /******  at32 specific interrupt numbers *********************************************************/
     WWDT_IRQn                   = 0,      /*!< window watchdog timer interrupt                      */
     PVM_IRQn                    = 1,      /*!< pvm through exint line detection interrupt           */
     TAMP_STAMP_IRQn             = 2,      /*!< tamper and timestamp interrupts through the exint line */
     ERTC_WKUP_IRQn              = 3,      /*!< ertc wakeup through the exint line                   */
     FLASH_IRQn                  = 4,      /*!< flash global interrupt                               */
     CRM_IRQn                    = 5,      /*!< crm global interrupt                                 */
     EXINT0_IRQn                 = 6,      /*!< exint line0 interrupt                                */
     EXINT1_IRQn                 = 7,      /*!< exint line1 interrupt                                */
     EXINT2_IRQn                 = 8,      /*!< exint line2 interrupt                                */
     EXINT3_IRQn                 = 9,      /*!< exint line3 interrupt                                */
     EXINT4_IRQn                 = 10,     /*!< exint line4 interrupt                                */
     EDMA_Stream1_IRQn           = 11,     /*!< edma stream 1 global interrupt                       */
     EDMA_Stream2_IRQn           = 12,     /*!< edma stream 2 global interrupt                       */
     EDMA_Stream3_IRQn           = 13,     /*!< edma stream 3 global interrupt                       */
     EDMA_Stream4_IRQn           = 14,     /*!< edma stream 4 global interrupt                       */
     EDMA_Stream5_IRQn           = 15,     /*!< edma stream 5 global interrupt                       */
     EDMA_Stream6_IRQn           = 16,     /*!< edma stream 6 global interrupt                       */
     EDMA_Stream7_IRQn           = 17,     /*!< edma stream 7 global interrupt                       */
     ADC1_2_3_IRQn               = 18,     /*!< adc1 adc2 and adc3 global interrupt                  */
     CAN1_TX_IRQn                = 19,     /*!< can1 tx interrupts                                   */
     CAN1_RX0_IRQn               = 20,     /*!< can1 rx0 interrupts                                  */
     CAN1_RX1_IRQn               = 21,     /*!< can1 rx1 interrupt                                   */
     CAN1_SE_IRQn                = 22,     /*!< can1 se interrupt                                    */
     EXINT9_5_IRQn               = 23,     /*!< external line[9:5] interrupts                        */
     TMR1_BRK_TMR9_IRQn          = 24,     /*!< tmr1 brake interrupt                                 */
     TMR1_OVF_TMR10_IRQn         = 25,     /*!< tmr1 overflow interrupt                              */
     TMR1_TRG_HALL_TMR11_IRQn    = 26,     /*!< tmr1 trigger and hall interrupt                      */
     TMR1_CH_IRQn                = 27,     /*!< tmr1 channel interrupt                               */
     TMR2_GLOBAL_IRQn            = 28,     /*!< tmr2 global interrupt                                */
     TMR3_GLOBAL_IRQn            = 29,     /*!< tmr3 global interrupt                                */
     TMR4_GLOBAL_IRQn            = 30,     /*!< tmr4 global interrupt                                */
     I2C1_EVT_IRQn               = 31,     /*!< i2c1 event interrupt                                 */
     I2C1_ERR_IRQn               = 32,     /*!< i2c1 error interrupt                                 */
     I2C2_EVT_IRQn               = 33,     /*!< i2c2 event interrupt                                 */
     I2C2_ERR_IRQn               = 34,     /*!< i2c2 error interrupt                                 */
     SPI1_IRQn                   = 35,     /*!< spi1 global interrupt                                */
     SPI2_I2S2EXT_IRQn           = 36,     /*!< spi2 global interrupt                                */
     USART1_IRQn                 = 37,     /*!< usart1 global interrupt                              */
     USART2_IRQn                 = 38,     /*!< usart2 global interrupt                              */
     USART3_IRQn                 = 39,     /*!< usart3 global interrupt                              */
     EXINT15_10_IRQn             = 40,     /*!< external line[15:10] interrupts                      */
     ERTCAlarm_IRQn              = 41,     /*!< ertc alarm through exint line interrupt              */
     OTGFS1_WKUP_IRQn            = 42,     /*!< otgfs1 wakeup from suspend through exint line interrupt */
     TMR8_BRK_TMR12_IRQn         = 43,     /*!< tmr8 brake interrupt                                 */
     TMR8_OVF_TMR13_IRQn         = 44,     /*!< tmr8 overflow interrupt                              */
     TMR8_TRG_HALL_TMR14_IRQn    = 45,     /*!< tmr8 trigger and hall interrupt                      */
     TMR8_CH_IRQn                = 46,     /*!< tmr8 channel interrupt                               */
     EDMA_Stream8_IRQn           = 47,     /*!< dma1 stream 8 global interrupt                       */
     XMC_IRQn                    = 48,     /*!< xmc global interrupt                                 */
     SDIO1_IRQn                  = 49,     /*!< sdio global interrupt                                */
     TMR5_GLOBAL_IRQn            = 50,     /*!< tmr5 global interrupt                                */
     SPI3_I2S3EXT_IRQn           = 51,     /*!< spi3 global interrupt                                */
     UART4_IRQn                  = 52,     /*!< uart4 global interrupt                               */
     UART5_IRQn                  = 53,     /*!< uart5 global interrupt                               */
     TMR6_DAC_GLOBAL_IRQn        = 54,     /*!< tmr6 and dac global interrupt                        */
     TMR7_GLOBAL_IRQn            = 55,     /*!< tmr7 global interrupt                                */
     DMA1_Channel1_IRQn          = 56,     /*!< dma1 channel 0 global interrupt                      */
     DMA1_Channel2_IRQn          = 57,     /*!< dma1 channel 1 global interrupt                      */
     DMA1_Channel3_IRQn          = 58,     /*!< dma1 channel 2 global interrupt                      */
     DMA1_Channel4_IRQn          = 59,     /*!< dma1 channel 3 global interrupt                      */
     DMA1_Channel5_IRQn          = 60,     /*!< dma1 channel 4 global interrupt                      */
     EMAC_IRQn                   = 61,     /*!< emac interrupt                                       */
     EMAC_WKUP_IRQn              = 62,     /*!< emac wakeup interrupt                                */
     CAN2_TX_IRQn                = 63,     /*!< can2 tx interrupt                                    */
     CAN2_RX0_IRQn               = 64,     /*!< can2 rx0 interrupt                                   */
     CAN2_RX1_IRQn               = 65,     /*!< can2 rx1 interrupt                                   */
     CAN2_SE_IRQn                = 66,     /*!< can2 se interrupt                                    */
     OTGFS1_IRQn                 = 67,     /*!< otgfs1 interrupt                                     */
     DMA1_Channel6_IRQn          = 68,     /*!< dma1 channel 5 global interrupt                      */
     DMA1_Channel7_IRQn          = 69,     /*!< dma1 channel 6 global interrupt                      */
     USART6_IRQn                 = 71,     /*!< usart6 interrupt                                     */
     I2C3_EVT_IRQn               = 72,     /*!< i2c3 event interrupt                                 */
     I2C3_ERR_IRQn               = 73,     /*!< i2c3 error interrupt                                 */
     OTGFS2_WKUP_IRQn            = 76,     /*!< otgfs2 wakeup from suspend through exint line interrupt */
     OTGFS2_IRQn                 = 77,     /*!< otgfs2 interrupt                                     */
     DVP_IRQn                    = 78,     /*!< dvp interrupt                                        */
     FPU_IRQn                    = 81,     /*!< fpu interrupt                                        */
     UART7_IRQn                  = 82,     /*!< uart7 interrupt                                      */
     SPI4_IRQn                   = 84,     /*!< spi4 global interrupt                                */
     QSPI2_IRQn                  = 91,     /*!< qspi2 global interrupt                               */
     QSPI1_IRQn                  = 92,     /*!< qspi1 global interrupt                               */
     DMAMUX_IRQn                 = 94,     /*!< dmamux global interrupt                              */
     SDIO2_IRQn                  = 102,    /*!< sdio2 global interrupt                               */
     ACC_IRQn                    = 103,    /*!< acc interrupt                                        */
     TMR20_BRK_IRQn              = 104,    /*!< tmr20 brake interrupt                                */
     TMR20_OVF_IRQn              = 105,    /*!< tmr20 overflow interrupt                             */
     TMR20_TRG_HALL_IRQn         = 106,    /*!< tmr20 trigger and hall interrupt                     */
     TMR20_CH_IRQn               = 107,    /*!< tmr20 channel interrupt                              */
     DMA2_Channel1_IRQn          = 108,    /*!< dma2 channel 1 global interrupt                      */
     DMA2_Channel2_IRQn          = 109,    /*!< dma2 channel 2 global interrupt                      */
     DMA2_Channel3_IRQn          = 110,    /*!< dma2 channel 3 global interrupt                      */
     DMA2_Channel4_IRQn          = 111,    /*!< dma2 channel 4 global interrupt                      */
     DMA2_Channel5_IRQn          = 112,    /*!< dma2 channel 5 global interrupt                      */
     DMA2_Channel6_IRQn          = 113,    /*!< dma2 channel 6 global interrupt                      */
     DMA2_Channel7_IRQn          = 114,    /*!< dma2 channel 7 global interrupt                      */
 } IRQn_Type;

/**
  * @}
  */

#include "core_cm4.h"
#include "system_at32f435_437.h"
#include <stdint.h>

