ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/** @addtogroup Bit_definition
  * @{
  */

/******************************************************************************/
/*                                                                            */
/*                         CRC calculation unit (CRC)                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for CRC_DT register  ********************/
#define CRC_DT_DT_Pos                       (0U)
#define CRC_DT_DT_Msk                       (0xFFFFFFFFU << CRC_DT_DT_Pos)          /*!< 0xFFFFFFFF */
#define CRC_DT_DT                           CRC_DT_DT_Msk                           /*!< Data register bits */

/*******************  Bit definition for CRC_CDT register  ********************/
#define CRC_CDT_CDT_Pos                     (0U)
#define CRC_CDT_CDT_Msk                     (0xFFU << CRC_CDT_CDT_Pos)              /*!< 0x000000FF */
#define CRC_CDT_CDT                         CRC_CDT_CDT_Msk                         /*!< General-purpose 8-bit data register bits */

/*******************  Bit definition for CRC_CTRL register  *******************/
#define CRC_CTRL_RST_Pos                    (0U)
#define CRC_CTRL_RST_Msk                    (0x1U << CRC_CTRL_RST_Pos)              /*!< 0x00000001 */
#define CRC_CTRL_RST                        CRC_CTRL_RST_Msk                        /*!< Reset CRC calculation unit */

/*!< POLY_SIZE configuration */
#define CRC_CTRL_POLY_SIZE_Pos              (3U)
#define CRC_CTRL_POLY_SIZE_Msk              (0x3U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000018 */
#define CRC_CTRL_POLY_SIZE                  CRC_CTRL_POLY_SIZE_Msk                  /*!< POLY_SIZE[1:0] bits (Polynomial size) */
#define CRC_CTRL_POLY_SIZE_0                (0x1U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000008 */
#define CRC_CTRL_POLY_SIZE_1                (0x2U << CRC_CTRL_POLY_SIZE_Pos)        /*!< 0x00000010 */

#define CRC_CTRL_POLY_SIZE_32BIT            0x00000000U                             /*!< 32-bit */
#define CRC_CTRL_POLY_SIZE_16BIT_Pos        (3U)
#define CRC_CTRL_POLY_SIZE_16BIT_Msk        (0x1U << CRC_CTRL_POLY_SIZE_16BIT_Pos)  /*!< 0x00000008 */
#define CRC_CTRL_POLY_SIZE_16BIT            CRC_CTRL_POLY_SIZE_16BIT_Msk            /*!< 16-bit */
#define CRC_CTRL_POLY_SIZE_8BIT_Pos         (4U)
#define CRC_CTRL_POLY_SIZE_8BIT_Msk         (0x1U << CRC_CTRL_POLY_SIZE_8BIT_Pos)   /*!< 0x00000010 */
#define CRC_CTRL_POLY_SIZE_8BIT             CRC_CTRL_POLY_SIZE_8BIT_Msk             /*!< 8-bit */
#define CRC_CTRL_POLY_SIZE_7BIT_Pos         (3U)
#define CRC_CTRL_POLY_SIZE_7BIT_Msk         (0x3U << CRC_CTRL_POLY_SIZE_7BIT_Pos)   /*!< 0x00000018 */
#define CRC_CTRL_POLY_SIZE_7BIT             CRC_CTRL_POLY_SIZE_7BIT_Msk             /*!< 7-bit */

/*!< REVID configuration */
#define CRC_CTRL_REVID_Pos                  (5U)
#define CRC_CTRL_REVID_Msk                  (0x3U << CRC_CTRL_REVID_Pos)            /*!< 0x00000060 */
#define CRC_CTRL_REVID                      CRC_CTRL_REVID_Msk                      /*!< REVID[1:0] bits (Reverse input data) */
#define CRC_CTRL_REVID_0                    (0x1U << CRC_CTRL_REVID_Pos)            /*!< 0x00000020 */
#define CRC_CTRL_REVID_1                    (0x2U << CRC_CTRL_REVID_Pos)            /*!< 0x00000040 */

#define CRC_CTRL_REVID_NOREV                0x00000000U                             /*!< No effect */
#define CRC_CTRL_REVID_BYTEREV_Pos          (5U)
#define CRC_CTRL_REVID_BYTEREV_Msk          (0x1U << CRC_CTRL_REVID_BYTEREV_Pos)    /*!< 0x00000020 */
#define CRC_CTRL_REVID_BYTEREV              CRC_CTRL_REVID_BYTEREV_Msk              /*!< Byte reverse */
#define CRC_CTRL_REVID_HALFREV_Pos          (6U)
#define CRC_CTRL_REVID_HALFREV_Msk          (0x1U << CRC_CTRL_REVID_HALFREV_Pos)    /*!< 0x00000040 */
#define CRC_CTRL_REVID_HALFREV              CRC_CTRL_REVID_HALFREV_Msk              /*!< Half-word reverse */
#define CRC_CTRL_REVID_WORDREV_Pos          (5U)
#define CRC_CTRL_REVID_WORDREV_Msk          (0x3U << CRC_CTRL_REVID_WORDREV_Pos)    /*!< 0x00000060 */
#define CRC_CTRL_REVID_WORDREV              CRC_CTRL_REVID_WORDREV_Msk              /*!< Word reverse */

#define CRC_CTRL_REVOD_Pos                  (7U)
#define CRC_CTRL_REVOD_Msk                  (0x1U << CRC_CTRL_REVOD_Pos)            /*!< 0x00000080 */
#define CRC_CTRL_REVOD                      CRC_CTRL_REVOD_Msk                      /*!< Reverse output data */

/*******************  Bit definition for CRC_IDT register  ********************/
#define CRC_IDT_IDT_Pos                     (0U)
#define CRC_IDT_IDT_Msk                     (0xFFFFFFFFU << CRC_IDT_IDT_Pos)        /*!< 0xFFFFFFFF */
#define CRC_IDT_IDT                         CRC_IDT_IDT_Msk                         /*!< Initialization data register */

/*******************  Bit definition for CRC_POLY register  *******************/
#define CRC_POLY_POLY_Pos                   (0U)
#define CRC_POLY_POLY_Msk                   (0xFFFFFFFFU << CRC_POLY_POLY_Pos)      /*!< 0xFFFFFFFF */
#define CRC_POLY_POLY                       CRC_POLY_POLY_Msk                       /*!< Polynomial coefficient */

/******************************************************************************/
/*                                                                            */
/*                        Clock and reset manage (CRM)                        */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CRM_CTRL register  *******************/
#define CRM_CTRL_HICKEN_Pos                 (0U)
#define CRM_CTRL_HICKEN_Msk                 (0x1U << CRM_CTRL_HICKEN_Pos)           /*!< 0x00000001 */
#define CRM_CTRL_HICKEN                     CRM_CTRL_HICKEN_Msk                     /*!< High speed internal clock enable */
#define CRM_CTRL_HICKSTBL_Pos               (1U)
#define CRM_CTRL_HICKSTBL_Msk               (0x1U << CRM_CTRL_HICKSTBL_Pos)         /*!< 0x00000002 */
#define CRM_CTRL_HICKSTBL                   CRM_CTRL_HICKSTBL_Msk                   /*!< High speed internal clock stable */
#define CRM_CTRL_HICKTRIM_Pos               (2U)
#define CRM_CTRL_HICKTRIM_Msk               (0x3FU << CRM_CTRL_HICKTRIM_Pos)        /*!< 0x000000FC */
#define CRM_CTRL_HICKTRIM                   CRM_CTRL_HICKTRIM_Msk                   /*!< High speed internal clock trimming */
#define CRM_CTRL_HICKCAL_Pos                (8U)
#define CRM_CTRL_HICKCAL_Msk                (0xFFU << CRM_CTRL_HICKCAL_Pos)         /*!< 0x0000FF00 */
#define CRM_CTRL_HICKCAL                    CRM_CTRL_HICKCAL_Msk                    /*!< High speed internal clock calibration */
#define CRM_CTRL_HEXTEN_Pos                 (16U)
#define CRM_CTRL_HEXTEN_Msk                 (0x1U << CRM_CTRL_HEXTEN_Pos)           /*!< 0x00010000 */
#define CRM_CTRL_HEXTEN                     CRM_CTRL_HEXTEN_Msk                     /*!< High speed external crystal enable */
#define CRM_CTRL_HEXTSTBL_Pos               (17U)
#define CRM_CTRL_HEXTSTBL_Msk               (0x1U << CRM_CTRL_HEXTSTBL_Pos)         /*!< 0x00020000 */
#define CRM_CTRL_HEXTSTBL                   CRM_CTRL_HEXTSTBL_Msk                   /*!< High speed external crystal stable */
#define CRM_CTRL_HEXTBYPS_Pos               (18U)
#define CRM_CTRL_HEXTBYPS_Msk               (0x1U << CRM_CTRL_HEXTBYPS_Pos)         /*!< 0x00040000 */
#define CRM_CTRL_HEXTBYPS                   CRM_CTRL_HEXTBYPS_Msk                   /*!< High speed external crystal bypass */
#define CRM_CTRL_CFDEN_Pos                  (19U)
#define CRM_CTRL_CFDEN_Msk                  (0x1U << CRM_CTRL_CFDEN_Pos)            /*!< 0x00080000 */
#define CRM_CTRL_CFDEN                      CRM_CTRL_CFDEN_Msk                      /*!< Clock failure detector enable */
#define CRM_CTRL_PLLEN_Pos                  (24U)
#define CRM_CTRL_PLLEN_Msk                  (0x1U << CRM_CTRL_PLLEN_Pos)            /*!< 0x01000000 */
#define CRM_CTRL_PLLEN                      CRM_CTRL_PLLEN_Msk                      /*!< PLL enable */
#define CRM_CTRL_PLLSTBL_Pos                (25U)
#define CRM_CTRL_PLLSTBL_Msk                (0x1U << CRM_CTRL_PLLSTBL_Pos)          /*!< 0x02000000 */
#define CRM_CTRL_PLLSTBL                    CRM_CTRL_PLLSTBL_Msk                    /*!< PLL clock stable */

/******************  Bit definition for CRM_PLLCFG register  ******************/
/*!< PLL_MS congiguration */
#define CRM_PLLCFG_PLL_MS_Pos               (0U)
#define CRM_PLLCFG_PLL_MS_Msk               (0xFU << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x0000000F */
#define CRM_PLLCFG_PLL_MS                   CRM_PLLCFG_PLL_MS_Msk                   /*!< PLL_MS[3:0] bits (PLL pre-division) */
#define CRM_PLLCFG_PLL_MS_0                 (0x1U << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x00000001 */
#define CRM_PLLCFG_PLL_MS_1                 (0x2U << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x00000002 */
#define CRM_PLLCFG_PLL_MS_2                 (0x4U << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x00000004 */
#define CRM_PLLCFG_PLL_MS_3                 (0x8U << CRM_PLLCFG_PLL_MS_Pos)         /*!< 0x00000008 */

/*!< PLL_NS congiguration */
#define CRM_PLLCFG_PLL_NS_Pos               (6U)
#define CRM_PLLCFG_PLL_NS_Msk               (0x1FFU << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00007FC0 */
#define CRM_PLLCFG_PLL_NS                   CRM_PLLCFG_PLL_NS_Msk                   /*!< PLL_NS[8:0] bits (PLL multiplication factor) */
#define CRM_PLLCFG_PLL_NS_0                 (0x001U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000040 */
#define CRM_PLLCFG_PLL_NS_1                 (0x002U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000080 */
#define CRM_PLLCFG_PLL_NS_2                 (0x004U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000100 */
#define CRM_PLLCFG_PLL_NS_3                 (0x008U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000200 */
#define CRM_PLLCFG_PLL_NS_4                 (0x010U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000400 */
#define CRM_PLLCFG_PLL_NS_5                 (0x020U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00000800 */
#define CRM_PLLCFG_PLL_NS_6                 (0x040U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00001000 */
#define CRM_PLLCFG_PLL_NS_7                 (0x080U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00002000 */
#define CRM_PLLCFG_PLL_NS_8                 (0x100U << CRM_PLLCFG_PLL_NS_Pos)       /*!< 0x00004000 */

/*!< PLL_FR congiguration */
#define CRM_PLLCFG_PLL_FR_Pos               (16U)
#define CRM_PLLCFG_PLL_FR_Msk               (0x7U << CRM_PLLCFG_PLL_FR_Pos)         /*!< 0x00070000 */
#define CRM_PLLCFG_PLL_FR                   CRM_PLLCFG_PLL_FR_Msk                   /*!< PLL_FP[2:0] bits (PLLP post-division) */
#define CRM_PLLCFG_PLL_FR_0                 (0x1U << CRM_PLLCFG_PLL_FR_Pos)         /*!< 0x00010000 */
#define CRM_PLLCFG_PLL_FR_1                 (0x2U << CRM_PLLCFG_PLL_FR_Pos)         /*!< 0x00020000 */
#define CRM_PLLCFG_PLL_FR_2                 (0x4U << CRM_PLLCFG_PLL_FR_Pos)         /*!< 0x00040000 */
#define CRM_PLLCFG_PLL_FR_3                 (0x8U << CRM_PLLCFG_PLL_FR_Pos)         /*!< 0x00080000 */

#define CRM_PLLCFG_PLLRCS_Pos               (22U)
#define CRM_PLLCFG_PLLRCS_Msk               (0x1U << CRM_PLLCFG_PLLRCS_Pos)         /*!< 0x40000000 */
#define CRM_PLLCFG_PLLRCS                   CRM_PLLCFG_PLLRCS_Msk                   /*!< PLL reference clock select */

/*******************  Bit definition for CRM_CFG register  ********************/
/*!< SCLKSEL configuration */
#define CRM_CFG_SCLKSEL_Pos                 (0U)
#define CRM_CFG_SCLKSEL_Msk                 (0x3U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000003 */
#define CRM_CFG_SCLKSEL                     CRM_CFG_SCLKSEL_Msk                     /*!< SCLKSEL[1:0] bits (System clock select) */
#define CRM_CFG_SCLKSEL_0                   (0x1U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000001 */
#define CRM_CFG_SCLKSEL_1                   (0x2U << CRM_CFG_SCLKSEL_Pos)           /*!< 0x00000002 */

#define CRM_CFG_SCLKSEL_HICK                0x00000000U                             /*!< HICK */
#define CRM_CFG_SCLKSEL_HEXT                0x00000001U                             /*!< HEXT */
#define CRM_CFG_SCLKSEL_PLL                 0x00000002U                             /*!< PLL */

/*!< SCLKSTS configuration */
#define CRM_CFG_SCLKSTS_Pos                 (2U)
#define CRM_CFG_SCLKSTS_Msk                 (0x3U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x0000000C */
#define CRM_CFG_SCLKSTS                     CRM_CFG_SCLKSTS_Msk                     /*!< SCLKSTS[1:0] bits (System clock select status) */
#define CRM_CFG_SCLKSTS_0                   (0x1U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x00000004 */
#define CRM_CFG_SCLKSTS_1                   (0x2U << CRM_CFG_SCLKSTS_Pos)           /*!< 0x00000008 */

#define CRM_CFG_SCLKSTS_HICK                0x00000000U                             /*!< HICK */
#define CRM_CFG_SCLKSTS_HEXT                0x00000004U                             /*!< HEXT */
#define CRM_CFG_SCLKSTS_PLL                 0x00000008U                             /*!< PLL */

/*!< AHBDIV configuration */
#define CRM_CFG_AHBDIV_Pos                  (4U)
#define CRM_CFG_AHBDIV_Msk                  (0xFU << CRM_CFG_AHBDIV_Pos)            /*!< 0x000000F0 */
#define CRM_CFG_AHBDIV                      CRM_CFG_AHBDIV_Msk                      /*!< AHBDIV[3:0] bits (AHB division) */
#define CRM_CFG_AHBDIV_0                    (0x1U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000010 */
#define CRM_CFG_AHBDIV_1                    (0x2U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000020 */
#define CRM_CFG_AHBDIV_2                    (0x4U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000040 */
#define CRM_CFG_AHBDIV_3                    (0x8U << CRM_CFG_AHBDIV_Pos)            /*!< 0x00000080 */

#define CRM_CFG_AHBDIV_DIV1                 0x00000000U                             /*!< SCLK is not divided */
#define CRM_CFG_AHBDIV_DIV2                 0x00000080U                             /*!< SCLK is divided by 2 */
#define CRM_CFG_AHBDIV_DIV4                 0x00000090U                             /*!< SCLK is divided by 4 */
#define CRM_CFG_AHBDIV_DIV8                 0x000000A0U                             /*!< SCLK is divided by 8 */
#define CRM_CFG_AHBDIV_DIV16                0x000000B0U                             /*!< SCLK is divided by 16 */
#define CRM_CFG_AHBDIV_DIV64                0x000000C0U                             /*!< SCLK is divided by 64 */
#define CRM_CFG_AHBDIV_DIV128               0x000000D0U                             /*!< SCLK is divided by 128 */
#define CRM_CFG_AHBDIV_DIV256               0x000000E0U                             /*!< SCLK is divided by 256 */
#define CRM_CFG_AHBDIV_DIV512               0x000000F0U                             /*!< SCLK is divided by 512 */

