ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/*!< APB1DIV configuration */
#define CRM_CFG_APB1DIV_Pos                 (10U)
#define CRM_CFG_APB1DIV_Msk                 (0x7U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00001C00 */
#define CRM_CFG_APB1DIV                     CRM_CFG_APB1DIV_Msk                     /*!< APB1DIV[2:0] bits (APB1 division) */
#define CRM_CFG_APB1DIV_0                   (0x1U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000400 */
#define CRM_CFG_APB1DIV_1                   (0x2U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000800 */
#define CRM_CFG_APB1DIV_2                   (0x4U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00001000 */

#define CRM_CFG_APB1DIV_DIV1                0x00000000U                             /*!< HCLK is not divided */
#define CRM_CFG_APB1DIV_DIV2                0x00001000U                             /*!< HCLK is divided by 2 */
#define CRM_CFG_APB1DIV_DIV4                0x00001400U                             /*!< HCLK is divided by 4 */
#define CRM_CFG_APB1DIV_DIV8                0x00001800U                             /*!< HCLK is divided by 8 */
#define CRM_CFG_APB1DIV_DIV16               0x00001C00U                             /*!< HCLK is divided by 16 */

/*!< APB2DIV configuration */
#define CRM_CFG_APB2DIV_Pos                 (13U)
#define CRM_CFG_APB2DIV_Msk                 (0x7U << CRM_CFG_APB2DIV_Pos)           /*!< 0x0000E000 */
#define CRM_CFG_APB2DIV                     CRM_CFG_APB2DIV_Msk                     /*!< APB2DIV[2:0] bits (APB2 division) */
#define CRM_CFG_APB2DIV_0                   (0x1U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00002000 */
#define CRM_CFG_APB2DIV_1                   (0x2U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00004000 */
#define CRM_CFG_APB2DIV_2                   (0x4U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00008000 */

#define CRM_CFG_APB2DIV_DIV1                0x00000000U                             /*!< HCLK is not divided */
#define CRM_CFG_APB2DIV_DIV2                0x00008000U                             /*!< HCLK is divided by 2 */
#define CRM_CFG_APB2DIV_DIV4                0x0000A000U                             /*!< HCLK is divided by 4 */
#define CRM_CFG_APB2DIV_DIV8                0x0000C000U                             /*!< HCLK is divided by 8 */
#define CRM_CFG_APB2DIV_DIV16               0x0000E000U                             /*!< HCLK is divided by 16 */

/*!< ERTCDIV configuration */
#define CRM_CFG_ERTCDIV_Pos                 (16U)
#define CRM_CFG_ERTCDIV_Msk                 (0x1FU << CRM_CFG_ERTCDIV_Pos)          /*!< 0x001F0000 */
#define CRM_CFG_ERTCDIV                     CRM_CFG_ERTCDIV_Msk                     /*!< ERTCDIV[4:0] bits (HEXT division for ERTC clock) */
#define CRM_CFG_ERTCDIV_0                   (0x01U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00010000 */
#define CRM_CFG_ERTCDIV_1                   (0x02U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00020000 */
#define CRM_CFG_ERTCDIV_2                   (0x04U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00040000 */
#define CRM_CFG_ERTCDIV_3                   (0x08U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00080000 */
#define CRM_CFG_ERTCDIV_4                   (0x10U << CRM_CFG_ERTCDIV_Pos)          /*!< 0x00100000 */

#define CRM_CFG_ERTCDIV_DIV2                0x00020000U                             /*!< HEXT/2 */
#define CRM_CFG_ERTCDIV_DIV3                0x00030000U                             /*!< HEXT/3 */
#define CRM_CFG_ERTCDIV_DIV4                0x00040000U                             /*!< HEXT/4 */
#define CRM_CFG_ERTCDIV_DIV5                0x00050000U                             /*!< HEXT/5 */
#define CRM_CFG_ERTCDIV_DIV6                0x00060000U                             /*!< HEXT/6 */
#define CRM_CFG_ERTCDIV_DIV7                0x00070000U                             /*!< HEXT/7 */
#define CRM_CFG_ERTCDIV_DIV8                0x00080000U                             /*!< HEXT/8 */
#define CRM_CFG_ERTCDIV_DIV9                0x00090000U                             /*!< HEXT/9 */
#define CRM_CFG_ERTCDIV_DIV10               0x000A0000U                             /*!< HEXT/10 */
#define CRM_CFG_ERTCDIV_DIV11               0x000B0000U                             /*!< HEXT/11 */
#define CRM_CFG_ERTCDIV_DIV12               0x000C0000U                             /*!< HEXT/12 */
#define CRM_CFG_ERTCDIV_DIV13               0x000D0000U                             /*!< HEXT/13 */
#define CRM_CFG_ERTCDIV_DIV14               0x000E0000U                             /*!< HEXT/14 */
#define CRM_CFG_ERTCDIV_DIV15               0x000F0000U                             /*!< HEXT/15 */
#define CRM_CFG_ERTCDIV_DIV16               0x00100000U                             /*!< HEXT/16 */
#define CRM_CFG_ERTCDIV_DIV17               0x00110000U                             /*!< HEXT/17 */
#define CRM_CFG_ERTCDIV_DIV18               0x00120000U                             /*!< HEXT/18 */
#define CRM_CFG_ERTCDIV_DIV19               0x00130000U                             /*!< HEXT/19 */
#define CRM_CFG_ERTCDIV_DIV20               0x00140000U                             /*!< HEXT/20 */
#define CRM_CFG_ERTCDIV_DIV21               0x00150000U                             /*!< HEXT/21 */
#define CRM_CFG_ERTCDIV_DIV22               0x00160000U                             /*!< HEXT/22 */
#define CRM_CFG_ERTCDIV_DIV23               0x00170000U                             /*!< HEXT/23 */
#define CRM_CFG_ERTCDIV_DIV24               0x00180000U                             /*!< HEXT/24 */
#define CRM_CFG_ERTCDIV_DIV25               0x00190000U                             /*!< HEXT/25 */
#define CRM_CFG_ERTCDIV_DIV26               0x001A0000U                             /*!< HEXT/26 */
#define CRM_CFG_ERTCDIV_DIV27               0x001B0000U                             /*!< HEXT/27 */
#define CRM_CFG_ERTCDIV_DIV28               0x001C0000U                             /*!< HEXT/28 */
#define CRM_CFG_ERTCDIV_DIV29               0x001D0000U                             /*!< HEXT/29 */
#define CRM_CFG_ERTCDIV_DIV30               0x001E0000U                             /*!< HEXT/30 */
#define CRM_CFG_ERTCDIV_DIV31               0x001F0000U                             /*!< HEXT/31 */

/*!< CLKOUTDIV1 configuration */
#define CRM_CFG_CLKOUTDIV1_Pos              (27U)
#define CRM_CFG_CLKOUTDIV1_Msk              (0x7U << CRM_CFG_CLKOUTDIV1_Pos)        /*!< 0x38000000 */
#define CRM_CFG_CLKOUTDIV1                  CRM_CFG_CLKOUTDIV1_Msk                  /*!< CLKOUTDIV1[2:0] bits (Clock output division 1) */
#define CRM_CFG_CLKOUTDIV1_0                (0x1U << CRM_CFG_CLKOUTDIV1_Pos)        /*!< 0x08000000 */
#define CRM_CFG_CLKOUTDIV1_1                (0x2U << CRM_CFG_CLKOUTDIV1_Pos)        /*!< 0x10000000 */
#define CRM_CFG_CLKOUTDIV1_2                (0x4U << CRM_CFG_CLKOUTDIV1_Pos)        /*!< 0x20000000 */

#define CRM_CFG_CLKOUTDIV1_DIV1             0x00000000U                             /*!< No clock output */
#define CRM_CFG_CLKOUTDIV1_DIV2             0x20000000U                             /*!< Clock output divided by 2 */
#define CRM_CFG_CLKOUTDIV1_DIV3             0x28000000U                             /*!< Clock output divided by 3 */
#define CRM_CFG_CLKOUTDIV1_DIV4             0x30000000U                             /*!< Clock output divided by 4 */
#define CRM_CFG_CLKOUTDIV1_DIV5             0x38000000U                             /*!< Clock output divided by 5 */

/*!< CLKOUT_SEL1 configuration */
#define CRM_CFG_CLKOUT_SEL1_Pos             (30U)
#define CRM_CFG_CLKOUT_SEL1_Msk             (0x3U << CRM_CFG_CLKOUT_SEL1_Pos)       /*!< 0xC0000000 */
#define CRM_CFG_CLKOUT_SEL1                 CRM_CFG_CLKOUT_SEL1_Msk                 /*!< CLKOUT_SEL1[1:0] bits (Clock output selection 1) */
#define CRM_CFG_CLKOUT_SEL1_0               (0x1U << CRM_CFG_CLKOUT_SEL1_Pos)       /*!< 0x40000000 */
#define CRM_CFG_CLKOUT_SEL1_1               (0x2U << CRM_CFG_CLKOUT_SEL1_Pos)       /*!< 0x80000000 */

