ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/*****************  Bit definition for CRM_APB1LPEN register  *****************/
#define CRM_APB1LPEN_TMR2LPEN_Pos           (0U)
#define CRM_APB1LPEN_TMR2LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR2LPEN_Pos)     /*!< 0x00000001 */
#define CRM_APB1LPEN_TMR2LPEN               CRM_APB1LPEN_TMR2LPEN_Msk               /*!< TMR2 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR3LPEN_Pos           (1U)
#define CRM_APB1LPEN_TMR3LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR3LPEN_Pos)     /*!< 0x00000002 */
#define CRM_APB1LPEN_TMR3LPEN               CRM_APB1LPEN_TMR3LPEN_Msk               /*!< TMR3 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR4LPEN_Pos           (2U)
#define CRM_APB1LPEN_TMR4LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR4LPEN_Pos)     /*!< 0x00000004 */
#define CRM_APB1LPEN_TMR4LPEN               CRM_APB1LPEN_TMR4LPEN_Msk               /*!< TMR4 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR5LPEN_Pos           (3U)
#define CRM_APB1LPEN_TMR5LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR5LPEN_Pos)     /*!< 0x00000008 */
#define CRM_APB1LPEN_TMR5LPEN               CRM_APB1LPEN_TMR5LPEN_Msk               /*!< TMR5 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR6LPEN_Pos           (4U)
#define CRM_APB1LPEN_TMR6LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR6LPEN_Pos)     /*!< 0x00000010 */
#define CRM_APB1LPEN_TMR6LPEN               CRM_APB1LPEN_TMR6LPEN_Msk               /*!< TMR6 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR7LPEN_Pos           (5U)
#define CRM_APB1LPEN_TMR7LPEN_Msk           (0x1U << CRM_APB1LPEN_TMR7LPEN_Pos)     /*!< 0x00000020 */
#define CRM_APB1LPEN_TMR7LPEN               CRM_APB1LPEN_TMR7LPEN_Msk               /*!< TMR7 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR12LPEN_Pos          (6U)
#define CRM_APB1LPEN_TMR12LPEN_Msk          (0x1U << CRM_APB1LPEN_TMR12LPEN_Pos)    /*!< 0x00000040 */
#define CRM_APB1LPEN_TMR12LPEN              CRM_APB1LPEN_TMR12LPEN_Msk              /*!< TMR12 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR13LPEN_Pos          (7U)
#define CRM_APB1LPEN_TMR13LPEN_Msk          (0x1U << CRM_APB1LPEN_TMR13LPEN_Pos)    /*!< 0x00000080 */
#define CRM_APB1LPEN_TMR13LPEN              CRM_APB1LPEN_TMR13LPEN_Msk              /*!< TMR13 clock enable in sleep mode */
#define CRM_APB1LPEN_TMR14LPEN_Pos          (8U)
#define CRM_APB1LPEN_TMR14LPEN_Msk          (0x1U << CRM_APB1LPEN_TMR14LPEN_Pos)    /*!< 0x00000100 */
#define CRM_APB1LPEN_TMR14LPEN              CRM_APB1LPEN_TMR14LPEN_Msk              /*!< TMR14 clock enable in sleep mode */
#define CRM_APB1LPEN_WWDTLPEN_Pos           (11U)
#define CRM_APB1LPEN_WWDTLPEN_Msk           (0x1U << CRM_APB1LPEN_WWDTLPEN_Pos)     /*!< 0x00000800 */
#define CRM_APB1LPEN_WWDTLPEN               CRM_APB1LPEN_WWDTLPEN_Msk               /*!< WWDT clock enable in sleep mode */
#define CRM_APB1LPEN_SPI2LPEN_Pos           (14U)
#define CRM_APB1LPEN_SPI2LPEN_Msk           (0x1U << CRM_APB1LPEN_SPI2LPEN_Pos)     /*!< 0x00004000 */
#define CRM_APB1LPEN_SPI2LPEN               CRM_APB1LPEN_SPI2LPEN_Msk               /*!< SPI2 clock enable in sleep mode */
#define CRM_APB1LPEN_SPI3LPEN_Pos           (15U)
#define CRM_APB1LPEN_SPI3LPEN_Msk           (0x1U << CRM_APB1LPEN_SPI3LPEN_Pos)     /*!< 0x00008000 */
#define CRM_APB1LPEN_SPI3LPEN               CRM_APB1LPEN_SPI3LPEN_Msk               /*!< SPI3 clock enable in sleep mode */
#define CRM_APB1LPEN_USART2LPEN_Pos         (17U)
#define CRM_APB1LPEN_USART2LPEN_Msk         (0x1U << CRM_APB1LPEN_USART2LPEN_Pos)   /*!< 0x00020000 */
#define CRM_APB1LPEN_USART2LPEN             CRM_APB1LPEN_USART2LPEN_Msk             /*!< USART2 clock enable in sleep mode */
#define CRM_APB1LPEN_USART3LPEN_Pos         (18U)
#define CRM_APB1LPEN_USART3LPEN_Msk         (0x1U << CRM_APB1LPEN_USART3LPEN_Pos)   /*!< 0x00040000 */
#define CRM_APB1LPEN_USART3LPEN             CRM_APB1LPEN_USART3LPEN_Msk             /*!< USART3 clock enable in sleep mode */
#define CRM_APB1LPEN_USART4LPEN_Pos         (19U)
#define CRM_APB1LPEN_USART4LPEN_Msk         (0x1U << CRM_APB1LPEN_USART4LPEN_Pos)   /*!< 0x00080000 */
#define CRM_APB1LPEN_USART4LPEN             CRM_APB1LPEN_USART4LPEN_Msk             /*!< USART4 clock enable in sleep mode */
#define CRM_APB1LPEN_USART5LPEN_Pos         (20U)
#define CRM_APB1LPEN_USART5LPEN_Msk         (0x1U << CRM_APB1LPEN_USART5LPEN_Pos)   /*!< 0x00100000 */
#define CRM_APB1LPEN_USART5LPEN             CRM_APB1LPEN_USART5LPEN_Msk             /*!< USART5 clock enable in sleep mode */
#define CRM_APB1LPEN_I2C1LPEN_Pos           (21U)
#define CRM_APB1LPEN_I2C1LPEN_Msk           (0x1U << CRM_APB1LPEN_I2C1LPEN_Pos)     /*!< 0x00200000 */
#define CRM_APB1LPEN_I2C1LPEN               CRM_APB1LPEN_I2C1LPEN_Msk               /*!< I2C1 clock enable in sleep mode */
#define CRM_APB1LPEN_I2C2LPEN_Pos           (22U)
#define CRM_APB1LPEN_I2C2LPEN_Msk           (0x1U << CRM_APB1LPEN_I2C2LPEN_Pos)     /*!< 0x00400000 */
#define CRM_APB1LPEN_I2C2LPEN               CRM_APB1LPEN_I2C2LPEN_Msk               /*!< I2C2 clock enable in sleep mode */
#define CRM_APB1LPEN_I2C3LPEN_Pos           (23U)
#define CRM_APB1LPEN_I2C3LPEN_Msk           (0x1U << CRM_APB1LPEN_I2C3LPEN_Pos)     /*!< 0x00800000 */
#define CRM_APB1LPEN_I2C3LPEN               CRM_APB1LPEN_I2C3LPEN_Msk               /*!< I2C3 clock enable in sleep mode */
#define CRM_APB1LPEN_CAN1LPEN_Pos           (25U)
#define CRM_APB1LPEN_CAN1LPEN_Msk           (0x1U << CRM_APB1LPEN_CAN1LPEN_Pos)     /*!< 0x02000000 */
#define CRM_APB1LPEN_CAN1LPEN               CRM_APB1LPEN_CAN1LPEN_Msk               /*!< CAN1 clock enable in sleep mode */
#define CRM_APB1LPEN_CAN2LPEN_Pos           (26U)
#define CRM_APB1LPEN_CAN2LPEN_Msk           (0x1U << CRM_APB1LPEN_CAN2LPEN_Pos)     /*!< 0x04000000 */
#define CRM_APB1LPEN_CAN2LPEN               CRM_APB1LPEN_CAN2LPEN_Msk               /*!< CAN2 clock enable in sleep mode */
#define CRM_APB1LPEN_PWCLPEN_Pos            (28U)
#define CRM_APB1LPEN_PWCLPEN_Msk            (0x1U << CRM_APB1LPEN_PWCLPEN_Pos)      /*!< 0x10000000 */
#define CRM_APB1LPEN_PWCLPEN                CRM_APB1LPEN_PWCLPEN_Msk                /*!< Power control clock enable in sleep mode */
#define CRM_APB1LPEN_DACLPEN_Pos            (29U)
#define CRM_APB1LPEN_DACLPEN_Msk            (0x1U << CRM_APB1LPEN_DACLPEN_Pos)      /*!< 0x20000000 */
#define CRM_APB1LPEN_DACLPEN                CRM_APB1LPEN_DACLPEN_Msk                /*!< DAC enable in sleep mode */
#define CRM_APB1LPEN_UART7LPEN_Pos          (30U)
#define CRM_APB1LPEN_UART7LPEN_Msk          (0x1U << CRM_APB1LPEN_UART7LPEN_Pos)    /*!< 0x40000000 */
#define CRM_APB1LPEN_UART7LPEN              CRM_APB1LPEN_UART7LPEN_Msk              /*!< UART7 clock enable in sleep mode */
#define CRM_APB1LPEN_UART8LPEN_Pos          (31U)
#define CRM_APB1LPEN_UART8LPEN_Msk          (0x1U << CRM_APB1LPEN_UART8LPEN_Pos)    /*!< 0x80000000 */
#define CRM_APB1LPEN_UART8LPEN              CRM_APB1LPEN_UART8LPEN_Msk              /*!< UART8 clock enable in sleep mode */

