ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/*!< CLKOUT_SEL2 congiguration */
#define CRM_MISC1_CLKOUT_SEL2_Pos           (16U)
#define CRM_MISC1_CLKOUT_SEL2_Msk           (0xFU << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x000F0000 */
#define CRM_MISC1_CLKOUT_SEL2               CRM_MISC1_CLKOUT_SEL2_Msk               /*!< CLKOUT_SEL2[3:0] bits (Clock output selection 2) */
#define CRM_MISC1_CLKOUT_SEL2_0             (0x1U << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x00010000 */
#define CRM_MISC1_CLKOUT_SEL2_1             (0x2U << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x00020000 */
#define CRM_MISC1_CLKOUT_SEL2_2             (0x4U << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x00040000 */
#define CRM_MISC1_CLKOUT_SEL2_3             (0x8U << CRM_MISC1_CLKOUT_SEL2_Pos)     /*!< 0x00080000 */

#define CRM_MISC1_CLKOUT_SEL2_USBFS         0x00000000U                             /*!< USBFS 48M */
#define CRM_MISC1_CLKOUT_SEL2_ADC           0x00010000U                             /*!< ADC */
#define CRM_MISC1_CLKOUT_SEL2_HICK          0x00020000U                             /*!< HICK */
#define CRM_MISC1_CLKOUT_SEL2_LICK          0x00030000U                             /*!< LICK */
#define CRM_MISC1_CLKOUT_SEL2_LEXT          0x00040000U                             /*!< LEXT */

/* Reference defines */
#define CRM_MISC1_CLKSEL2                   CRM_MISC1_CLKOUT_SEL2
#define CRM_MISC1_CLKSEL2_0                 CRM_MISC1_CLKOUT_SEL2_0
#define CRM_MISC1_CLKSEL2_1                 CRM_MISC1_CLKOUT_SEL2_1
#define CRM_MISC1_CLKSEL2_2                 CRM_MISC1_CLKOUT_SEL2_2
#define CRM_MISC1_CLKSEL2_3                 CRM_MISC1_CLKOUT_SEL2_3
#define CRM_MISC1_CLKSEL2_USBFS             CRM_MISC1_CLKOUT_SEL2_USBFS
#define CRM_MISC1_CLKSEL2_ADC               CRM_MISC1_CLKOUT_SEL2_ADC
#define CRM_MISC1_CLKSEL2_HICK              CRM_MISC1_CLKOUT_SEL2_HICK
#define CRM_MISC1_CLKSEL2_LICK              CRM_MISC1_CLKOUT_SEL2_LICK
#define CRM_MISC1_CLKSEL2_LEXT              CRM_MISC1_CLKOUT_SEL2_LEXT

/*!< CLKOUTDIV2 congiguration */
#define CRM_MISC1_CLKOUTDIV2_Pos            (28U)
#define CRM_MISC1_CLKOUTDIV2_Msk            (0xFU << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0xF0000000 */
#define CRM_MISC1_CLKOUTDIV2                CRM_MISC1_CLKOUTDIV2_Msk                /*!< CLKOUTDIV2[3:0] bits (Clock output division 2) */
#define CRM_MISC1_CLKOUTDIV2_0              (0x1U << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0x10000000 */
#define CRM_MISC1_CLKOUTDIV2_1              (0x2U << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0x20000000 */
#define CRM_MISC1_CLKOUTDIV2_2              (0x4U << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0x40000000 */
#define CRM_MISC1_CLKOUTDIV2_3              (0x8U << CRM_MISC1_CLKOUTDIV2_Pos)      /*!< 0x80000000 */

#define CRM_MISC1_CLKOUTDIV2_DIV1           0x00000000U                             /*!< No clock output */
#define CRM_MISC1_CLKOUTDIV2_DIV2           0x80000000U                             /*!< Clock output divided by 2 */
#define CRM_MISC1_CLKOUTDIV2_DIV4           0x90000000U                             /*!< Clock output divided by 4 */
#define CRM_MISC1_CLKOUTDIV2_DIV8           0xA0000000U                             /*!< Clock output divided by 8 */
#define CRM_MISC1_CLKOUTDIV2_DIV16          0xB0000000U                             /*!< Clock output divided by 16 */
#define CRM_MISC1_CLKOUTDIV2_DIV64          0xC0000000U                             /*!< Clock output divided by 64 */
#define CRM_MISC1_CLKOUTDIV2_DIV128         0xD0000000U                             /*!< Clock output divided by 128 */
#define CRM_MISC1_CLKOUTDIV2_DIV256         0xE0000000U                             /*!< Clock output divided by 256 */
#define CRM_MISC1_CLKOUTDIV2_DIV512         0xF0000000U                             /*!< Clock output divided by 512 */

/******************  Bit definition for CRM_MISC2 register  *******************/
/*!< AUTO_STEP_EN congiguration */
#define CRM_MISC2_AUTO_STEP_EN_Pos          (4U)
#define CRM_MISC2_AUTO_STEP_EN_Msk          (0x3U << CRM_MISC2_AUTO_STEP_EN_Pos)    /*!< 0x00000030 */
#define CRM_MISC2_AUTO_STEP_EN              CRM_MISC2_AUTO_STEP_EN_Msk              /*!< AUTO_STEP_EN[1:0] bits (Auto step-by-step SCLK switch enable) */
#define CRM_MISC2_AUTO_STEP_EN_0            (0x1U << CRM_MISC2_AUTO_STEP_EN_Pos)    /*!< 0x00000010 */
#define CRM_MISC2_AUTO_STEP_EN_1            (0x2U << CRM_MISC2_AUTO_STEP_EN_Pos)    /*!< 0x00000020 */

#define CRM_MISC2_CLK1_TO_TMR_Pos           (8U)
#define CRM_MISC2_CLK1_TO_TMR_Msk           (0x1U << CRM_MISC1_CLK1_TO_TMR_Pos)    /*!< 0x00000100 */
#define CRM_MISC2_CLK1_TO_TMR               CRM_MISC1_CLK1_TO_TMR_Msk              /*!< CLK1 to timer select */

#define CRM_MISC2_EMAC_PPS_SEL_Pos          (9U)
#define CRM_MISC2_EMAC_PPS_SEL_Msk          (0x1U << CRM_MISC1_EMAC_PPS_SEL_Pos)    /*!< 0x00000200 */
#define CRM_MISC2_EMAC_PPS_SEL              CRM_MISC1_EMAC_PPS_SEL_Msk              /*!< Ethernet pulse width select */

/*!< USBDIV configuration */
#define CRM_MISC2_USBDIV_Pos                (12U)
#define CRM_MISC2_USBDIV_Msk                (0xFU << CRM_MISC2_USBDIV_Pos)          /*!< 0x0000F000 */
#define CRM_MISC2_USBDIV                    CRM_MISC2_USBDIV_Msk                    /*!< USB division */
#define CRM_MISC2_USBDIV_0                  (0x1U << CRM_MISC2_USBDIV_Pos)          /*!< 0x00001000 */
#define CRM_MISC2_USBDIV_1                  (0x2U << CRM_MISC2_USBDIV_Pos)          /*!< 0x00002000 */
#define CRM_MISC2_USBDIV_2                  (0x4U << CRM_MISC2_USBDIV_Pos)          /*!< 0x00004000 */
#define CRM_MISC2_USBDIV_4                  (0x8U << CRM_MISC2_USBDIV_Pos)          /*!< 0x00008000 */
#define CRM_MISC2_USBDIV_DIV1_5             0x00000000U                             /*!< PLL/1.5 */
#define CRM_MISC2_USBDIV_DIV1               0x00001000U                             /*!< PLL/1 */
#define CRM_MISC2_USBDIV_DIV2_5             0x00002000U                             /*!< PLL/2.5 */
#define CRM_MISC2_USBDIV_DIV2               0x00003000U                             /*!< PLL/2 */
#define CRM_MISC2_USBDIV_DIV3_5             0x00004000U                             /*!< PLL/3.5 */
#define CRM_MISC2_USBDIV_DIV3               0x00005000U                             /*!< PLL/3 */
#define CRM_MISC2_USBDIV_DIV4_5             0x00006000U                             /*!< PLL/4.5 */
#define CRM_MISC2_USBDIV_DIV4               0x00007000U                             /*!< PLL/4 */
#define CRM_MISC2_USBDIV_DIV5_5             0x00008000U                             /*!< PLL/5.5 */
#define CRM_MISC2_USBDIV_DIV5               0x00009000U                             /*!< PLL/5 */
#define CRM_MISC2_USBDIV_DIV6_5             0x0000A000U                             /*!< PLL/6.5 */
#define CRM_MISC2_USBDIV_DIV6               0x0000B000U                             /*!< PLL/6 */
#define CRM_MISC2_USBDIV_DIV7               0x0000C000U                             /*!< PLL/7 */

/******************************************************************************/
/*                                                                            */
/*                      Enhanced real-time clock (ERTC)                       */
/*                                                                            */
/******************************************************************************/

