ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
#define SCFG_EXINTC2_EXINT6_GPA             0x00000000U                             /*!< GPIOA pin 6 */
#define SCFG_EXINTC2_EXINT6_GPB_Pos         (8U)
#define SCFG_EXINTC2_EXINT6_GPB_Msk         (0x1U << SCFG_EXINTC2_EXINT6_GPB_Pos)   /*!< 0x00000100 */
#define SCFG_EXINTC2_EXINT6_GPB             SCFG_EXINTC2_EXINT6_GPB_Msk             /*!< GPIOB pin 6 */
#define SCFG_EXINTC2_EXINT6_GPC_Pos         (9U)
#define SCFG_EXINTC2_EXINT6_GPC_Msk         (0x1U << SCFG_EXINTC2_EXINT6_GPC_Pos)   /*!< 0x00000200 */
#define SCFG_EXINTC2_EXINT6_GPC             SCFG_EXINTC2_EXINT6_GPC_Msk             /*!< GPIOC pin 6 */
#define SCFG_EXINTC2_EXINT6_GPD_Pos         (8U)
#define SCFG_EXINTC2_EXINT6_GPD_Msk         (0x3U << SCFG_EXINTC2_EXINT6_GPD_Pos)   /*!< 0x00000300 */
#define SCFG_EXINTC2_EXINT6_GPD             SCFG_EXINTC2_EXINT6_GPD_Msk             /*!< GPIOD pin 6 */
#define SCFG_EXINTC2_EXINT6_GPE_Pos         (8U)
#define SCFG_EXINTC2_EXINT6_GPE_Msk         (0x4U << SCFG_EXINTC2_EXINT6_GPE_Pos)   /*!< 0x00000400 */
#define SCFG_EXINTC2_EXINT6_GPE             SCFG_EXINTC2_EXINT6_GPE_Msk             /*!< GPIOD pin 6 */
#define SCFG_EXINTC2_EXINT6_GPF_Pos         (8U)
#define SCFG_EXINTC2_EXINT6_GPF_Msk         (0x5U << SCFG_EXINTC2_EXINT6_GPF_Pos)   /*!< 0x00000500 */
#define SCFG_EXINTC2_EXINT6_GPF             SCFG_EXINTC2_EXINT6_GPF_Msk             /*!< GPIOF pin 6 */
#define SCFG_EXINTC2_EXINT6_GPG_Pos         (8U)
#define SCFG_EXINTC2_EXINT6_GPG_Msk         (0x6U << SCFG_EXINTC2_EXINT6_GPG_Pos)   /*!< 0x00000600 */
#define SCFG_EXINTC2_EXINT6_GPG             SCFG_EXINTC2_EXINT6_GPG_Msk             /*!< GPIOD pin 6 */
#define SCFG_EXINTC2_EXINT6_GPH_Pos         (8U)
#define SCFG_EXINTC2_EXINT6_GPH_Msk         (0x7U << SCFG_EXINTC2_EXINT6_GPH_Pos)   /*!< 0x00000700 */
#define SCFG_EXINTC2_EXINT6_GPH             SCFG_EXINTC2_EXINT6_GPH_Msk             /*!< GPIOD pin 6 */

/*!< EXINT7 configuration */
#define SCFG_EXINTC2_EXINT7_Pos             (12U)
#define SCFG_EXINTC2_EXINT7_Msk             (0xFU << SCFG_EXINTC2_EXINT7_Pos)       /*!< 0x0000F000 */
#define SCFG_EXINTC2_EXINT7                 SCFG_EXINTC2_EXINT7_Msk                 /*!< EXINT7[3:0] bits (EXINT7 input source configuration) */

#define SCFG_EXINTC2_EXINT7_GPA             0x00000000U                             /*!< GPIOA pin 7 */
#define SCFG_EXINTC2_EXINT7_GPB_Pos         (12U)
#define SCFG_EXINTC2_EXINT7_GPB_Msk         (0x1U << SCFG_EXINTC2_EXINT7_GPB_Pos)   /*!< 0x00001000 */
#define SCFG_EXINTC2_EXINT7_GPB             SCFG_EXINTC2_EXINT7_GPB_Msk             /*!< GPIOB pin 7 */
#define SCFG_EXINTC2_EXINT7_GPC_Pos         (13U)
#define SCFG_EXINTC2_EXINT7_GPC_Msk         (0x1U << SCFG_EXINTC2_EXINT7_GPC_Pos)   /*!< 0x00002000 */
#define SCFG_EXINTC2_EXINT7_GPC             SCFG_EXINTC2_EXINT7_GPC_Msk             /*!< GPIOC pin 7 */
#define SCFG_EXINTC2_EXINT7_GPD_Pos         (12U)
#define SCFG_EXINTC2_EXINT7_GPD_Msk         (0x3U << SCFG_EXINTC2_EXINT7_GPD_Pos)   /*!< 0x00003000 */
#define SCFG_EXINTC2_EXINT7_GPD             SCFG_EXINTC2_EXINT7_GPD_Msk             /*!< GPIOD pin 7 */
#define SCFG_EXINTC2_EXINT7_GPE_Pos         (12U)
#define SCFG_EXINTC2_EXINT7_GPE_Msk         (0x4U << SCFG_EXINTC2_EXINT7_GPE_Pos)   /*!< 0x00004000 */
#define SCFG_EXINTC2_EXINT7_GPE             SCFG_EXINTC2_EXINT7_GPE_Msk             /*!< GPIOD pin 7 */
#define SCFG_EXINTC2_EXINT7_GPF_Pos         (12U)
#define SCFG_EXINTC2_EXINT7_GPF_Msk         (0x5U << SCFG_EXINTC2_EXINT7_GPF_Pos)   /*!< 0x00005000 */
#define SCFG_EXINTC2_EXINT7_GPF             SCFG_EXINTC2_EXINT7_GPF_Msk             /*!< GPIOF pin 7 */
#define SCFG_EXINTC2_EXINT7_GPG_Pos         (12U)
#define SCFG_EXINTC2_EXINT7_GPG_Msk         (0x6U << SCFG_EXINTC2_EXINT7_GPG_Pos)   /*!< 0x00006000 */
#define SCFG_EXINTC2_EXINT7_GPG             SCFG_EXINTC2_EXINT7_GPG_Msk             /*!< GPIOF pin 7 */
#define SCFG_EXINTC2_EXINT7_GPH_Pos         (12U)
#define SCFG_EXINTC2_EXINT7_GPH_Msk         (0x7U << SCFG_EXINTC2_EXINT7_GPH_Pos)   /*!< 0x00007000 */
#define SCFG_EXINTC2_EXINT7_GPH             SCFG_EXINTC2_EXINT7_GPH_Msk             /*!< GPIOF pin 7 */

/*****************  Bit definition for SCFG_EXINTC3 register  *****************/
/*!< EXINT8 configuration */
#define SCFG_EXINTC3_EXINT8_Pos             (0U)
#define SCFG_EXINTC3_EXINT8_Msk             (0xFU << SCFG_EXINTC3_EXINT8_Pos)       /*!< 0x0000000F */
#define SCFG_EXINTC3_EXINT8                 SCFG_EXINTC3_EXINT8_Msk                 /*!< EXINT8[3:0] bits (EXINT8 input source configuration) */

#define SCFG_EXINTC3_EXINT8_GPA             0x00000000U                             /*!< GPIOA pin 8 */
#define SCFG_EXINTC3_EXINT8_GPB_Pos         (0U)
#define SCFG_EXINTC3_EXINT8_GPB_Msk         (0x1U << SCFG_EXINTC3_EXINT8_GPB_Pos)   /*!< 0x00000001 */
#define SCFG_EXINTC3_EXINT8_GPB             SCFG_EXINTC3_EXINT8_GPB_Msk             /*!< GPIOB pin 8 */
#define SCFG_EXINTC3_EXINT8_GPC_Pos         (1U)
#define SCFG_EXINTC3_EXINT8_GPC_Msk         (0x1U << SCFG_EXINTC3_EXINT8_GPC_Pos)   /*!< 0x00000002 */
#define SCFG_EXINTC3_EXINT8_GPC             SCFG_EXINTC3_EXINT8_GPC_Msk             /*!< GPIOC pin 8 */
#define SCFG_EXINTC3_EXINT8_GPD_Pos         (0U)
#define SCFG_EXINTC3_EXINT8_GPD_Msk         (0x3U << SCFG_EXINTC3_EXINT8_GPD_Pos)   /*!< 0x00000003 */
#define SCFG_EXINTC3_EXINT8_GPD             SCFG_EXINTC3_EXINT8_GPD_Msk             /*!< GPIOD pin 8 */
#define SCFG_EXINTC3_EXINT8_GPE_Pos         (0U)
#define SCFG_EXINTC3_EXINT8_GPE_Msk         (0x4U << SCFG_EXINTC3_EXINT8_GPE_Pos)   /*!< 0x00000004 */
#define SCFG_EXINTC3_EXINT8_GPE             SCFG_EXINTC3_EXINT8_GPE_Msk             /*!< GPIOD pin 8 */
#define SCFG_EXINTC3_EXINT8_GPF_Pos         (0U)
#define SCFG_EXINTC3_EXINT8_GPF_Msk         (0x5U << SCFG_EXINTC3_EXINT8_GPF_Pos)   /*!< 0x00000005 */
#define SCFG_EXINTC3_EXINT8_GPF             SCFG_EXINTC3_EXINT8_GPF_Msk             /*!< GPIOF pin 8 */
#define SCFG_EXINTC3_EXINT8_GPG_Pos         (0U)
#define SCFG_EXINTC3_EXINT8_GPG_Msk         (0x6U << SCFG_EXINTC3_EXINT8_GPG_Pos)   /*!< 0x00000006 */
#define SCFG_EXINTC3_EXINT8_GPG             SCFG_EXINTC3_EXINT8_GPG_Msk             /*!< GPIOF pin 8 */
#define SCFG_EXINTC3_EXINT8_GPH_Pos         (0U)
#define SCFG_EXINTC3_EXINT8_GPH_Msk         (0x7U << SCFG_EXINTC3_EXINT8_GPH_Pos)   /*!< 0x00000007 */
#define SCFG_EXINTC3_EXINT8_GPH             SCFG_EXINTC3_EXINT8_GPH_Msk             /*!< GPIOF pin 8 */

/*!< EXINT9 configuration */
#define SCFG_EXINTC3_EXINT9_Pos             (4U)
#define SCFG_EXINTC3_EXINT9_Msk             (0xFU << SCFG_EXINTC3_EXINT9_Pos)       /*!< 0x000000F0 */
#define SCFG_EXINTC3_EXINT9                 SCFG_EXINTC3_EXINT9_Msk                 /*!< EXINT9[3:0] bits (EXINT9 input source configuration) */

#define SCFG_EXINTC3_EXINT9_GPA             0x00000000U                             /*!< GPIOA pin 9 */
#define SCFG_EXINTC3_EXINT9_GPB_Pos         (4U)
#define SCFG_EXINTC3_EXINT9_GPB_Msk         (0x1U << SCFG_EXINTC3_EXINT9_GPB_Pos)   /*!< 0x00000010 */
#define SCFG_EXINTC3_EXINT9_GPB             SCFG_EXINTC3_EXINT9_GPB_Msk             /*!< GPIOB pin 9 */
#define SCFG_EXINTC3_EXINT9_GPC_Pos         (5U)
#define SCFG_EXINTC3_EXINT9_GPC_Msk         (0x1U << SCFG_EXINTC3_EXINT9_GPC_Pos)   /*!< 0x00000020 */
#define SCFG_EXINTC3_EXINT9_GPC             SCFG_EXINTC3_EXINT9_GPC_Msk             /*!< GPIOC pin 9 */
#define SCFG_EXINTC3_EXINT9_GPD_Pos         (4U)
#define SCFG_EXINTC3_EXINT9_GPD_Msk         (0x3U << SCFG_EXINTC3_EXINT9_GPD_Pos)   /*!< 0x00000030 */
#define SCFG_EXINTC3_EXINT9_GPD             SCFG_EXINTC3_EXINT9_GPD_Msk             /*!< GPIOD pin 9 */
#define SCFG_EXINTC3_EXINT9_GPE_Pos         (4U)
#define SCFG_EXINTC3_EXINT9_GPE_Msk         (0x4U << SCFG_EXINTC3_EXINT9_GPE_Pos)   /*!< 0x00000040 */
#define SCFG_EXINTC3_EXINT9_GPE             SCFG_EXINTC3_EXINT9_GPE_Msk             /*!< GPIOD pin 9 */
#define SCFG_EXINTC3_EXINT9_GPF_Pos         (4U)
#define SCFG_EXINTC3_EXINT9_GPF_Msk         (0x5U << SCFG_EXINTC3_EXINT9_GPF_Pos)   /*!< 0x00000050 */
#define SCFG_EXINTC3_EXINT9_GPF             SCFG_EXINTC3_EXINT9_GPF_Msk             /*!< GPIOF pin 9 */
#define SCFG_EXINTC3_EXINT9_GPG_Pos         (4U)
#define SCFG_EXINTC3_EXINT9_GPG_Msk         (0x6U << SCFG_EXINTC3_EXINT9_GPG_Pos)   /*!< 0x00000060 */
#define SCFG_EXINTC3_EXINT9_GPG             SCFG_EXINTC3_EXINT9_GPG_Msk             /*!< GPIOF pin 9 */
#define SCFG_EXINTC3_EXINT9_GPH_Pos         (4U)
#define SCFG_EXINTC3_EXINT9_GPH_Msk         (0x7U << SCFG_EXINTC3_EXINT9_GPH_Pos)   /*!< 0x00000070 */
#define SCFG_EXINTC3_EXINT9_GPH             SCFG_EXINTC3_EXINT9_GPH_Msk             /*!< GPIOF pin 9 */

/*!< EXINT10 configuration */
#define SCFG_EXINTC3_EXINT10_Pos            (8U)
#define SCFG_EXINTC3_EXINT10_Msk            (0xFU << SCFG_EXINTC3_EXINT10_Pos)      /*!< 0x00000F00 */
#define SCFG_EXINTC3_EXINT10                SCFG_EXINTC3_EXINT10_Msk                /*!< EXINT10[3:0] bits (EXINT10 input source configuration) */

#define SCFG_EXINTC3_EXINT10_GPA            0x00000000U                             /*!< GPIOA pin 10 */
#define SCFG_EXINTC3_EXINT10_GPB_Pos        (8U)
#define SCFG_EXINTC3_EXINT10_GPB_Msk        (0x1U << SCFG_EXINTC3_EXINT10_GPB_Pos)  /*!< 0x00000100 */
#define SCFG_EXINTC3_EXINT10_GPB            SCFG_EXINTC3_EXINT10_GPB_Msk            /*!< GPIOB pin 10 */
#define SCFG_EXINTC3_EXINT10_GPC_Pos        (9U)
#define SCFG_EXINTC3_EXINT10_GPC_Msk        (0x1U << SCFG_EXINTC3_EXINT10_GPC_Pos)  /*!< 0x00000200 */
#define SCFG_EXINTC3_EXINT10_GPC            SCFG_EXINTC3_EXINT10_GPC_Msk            /*!< GPIOC pin 10 */
#define SCFG_EXINTC3_EXINT10_GPD_Pos        (8U)
#define SCFG_EXINTC3_EXINT10_GPD_Msk        (0x3U << SCFG_EXINTC3_EXINT10_GPD_Pos)  /*!< 0x00000300 */
#define SCFG_EXINTC3_EXINT10_GPD            SCFG_EXINTC3_EXINT10_GPD_Msk            /*!< GPIOD pin 10 */
#define SCFG_EXINTC3_EXINT10_GPE_Pos        (8U)
#define SCFG_EXINTC3_EXINT10_GPE_Msk        (0x4U << SCFG_EXINTC3_EXINT10_GPE_Pos)  /*!< 0x00000400 */
#define SCFG_EXINTC3_EXINT10_GPE            SCFG_EXINTC3_EXINT10_GPE_Msk            /*!< GPIOD pin 10 */
#define SCFG_EXINTC3_EXINT10_GPF_Pos        (8U)
#define SCFG_EXINTC3_EXINT10_GPF_Msk        (0x5U << SCFG_EXINTC3_EXINT10_GPF_Pos)  /*!< 0x00000500 */
#define SCFG_EXINTC3_EXINT10_GPF            SCFG_EXINTC3_EXINT10_GPF_Msk            /*!< GPIOF pin 10 */
#define SCFG_EXINTC3_EXINT10_GPG_Pos        (8U)
#define SCFG_EXINTC3_EXINT10_GPG_Msk        (0x6U << SCFG_EXINTC3_EXINT10_GPG_Pos)  /*!< 0x00000600 */
#define SCFG_EXINTC3_EXINT10_GPG            SCFG_EXINTC3_EXINT10_GPG_Msk            /*!< GPIOF pin 10 */
#define SCFG_EXINTC3_EXINT10_GPH_Pos        (8U)
#define SCFG_EXINTC3_EXINT10_GPH_Msk        (0x7U << SCFG_EXINTC3_EXINT10_GPH_Pos)  /*!< 0x00000500 */
#define SCFG_EXINTC3_EXINT10_GPH            SCFG_EXINTC3_EXINT10_GPH_Msk            /*!< GPIOF pin 10 */

