ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/* Legacy defines */
#define WWDT_CTRL_CNT0                      WWDT_CTRL_CNT_0
#define WWDT_CTRL_CNT1                      WWDT_CTRL_CNT_1
#define WWDT_CTRL_CNT2                      WWDT_CTRL_CNT_2
#define WWDT_CTRL_CNT3                      WWDT_CTRL_CNT_3
#define WWDT_CTRL_CNT4                      WWDT_CTRL_CNT_4
#define WWDT_CTRL_CNT5                      WWDT_CTRL_CNT_5
#define WWDT_CTRL_CNT6                      WWDT_CTRL_CNT_6

#define WWDT_CTRL_WWDTEN_Pos                (7U)
#define WWDT_CTRL_WWDTEN_Msk                (0x1U << WWDT_CTRL_WWDTEN_Pos)          /*!< 0x00000080 */
#define WWDT_CTRL_WWDTEN                    WWDT_CTRL_WWDTEN_Msk                    /*!< Window watchdog enable */

/*******************  Bit definition for WWDT_CFG register  *******************/
/*!< WIN configuration */
#define WWDT_CFG_WIN_Pos                    (0U)
#define WWDT_CFG_WIN_Msk                    (0x7FU << WWDT_CFG_WIN_Pos)             /*!< 0x0000007F */
#define WWDT_CFG_WIN                        WWDT_CFG_WIN_Msk                        /*!< WIN[6:0] bits (Window value) */
#define WWDT_CFG_WIN_0                      (0x01U << WWDT_CFG_WIN_Pos)             /*!< 0x00000001 */
#define WWDT_CFG_WIN_1                      (0x02U << WWDT_CFG_WIN_Pos)             /*!< 0x00000002 */
#define WWDT_CFG_WIN_2                      (0x04U << WWDT_CFG_WIN_Pos)             /*!< 0x00000004 */
#define WWDT_CFG_WIN_3                      (0x08U << WWDT_CFG_WIN_Pos)             /*!< 0x00000008 */
#define WWDT_CFG_WIN_4                      (0x10U << WWDT_CFG_WIN_Pos)             /*!< 0x00000010 */
#define WWDT_CFG_WIN_5                      (0x20U << WWDT_CFG_WIN_Pos)             /*!< 0x00000020 */
#define WWDT_CFG_WIN_6                      (0x40U << WWDT_CFG_WIN_Pos)             /*!< 0x00000040 */

/* Legacy defines */
#define WWDT_CFG_WIN0                       WWDT_CFG_WIN_0
#define WWDT_CFG_WIN1                       WWDT_CFG_WIN_1
#define WWDT_CFG_WIN2                       WWDT_CFG_WIN_2
#define WWDT_CFG_WIN3                       WWDT_CFG_WIN_3
#define WWDT_CFG_WIN4                       WWDT_CFG_WIN_4
#define WWDT_CFG_WIN5                       WWDT_CFG_WIN_5
#define WWDT_CFG_WIN6                       WWDT_CFG_WIN_6

/*!< DIV configuration */
#define WWDT_CFG_DIV_Pos                    (7U)
#define WWDT_CFG_DIV_Msk                    (0x3U << WWDT_CFG_DIV_Pos)              /*!< 0x00000180 */
#define WWDT_CFG_DIV                        WWDT_CFG_DIV_Msk                        /*!< DIV[1:0] bits (Clock division value) */
#define WWDT_CFG_DIV_0                      (0x1U << WWDT_CFG_DIV_Pos)              /*!< 0x00000080 */
#define WWDT_CFG_DIV_1                      (0x2U << WWDT_CFG_DIV_Pos)              /*!< 0x00000100 */

/* Legacy defines */
#define WWDT_CFG_DIV0                       WWDT_CFG_DIV_0
#define WWDT_CFG_DIV1                       WWDT_CFG_DIV_1

#define WWDT_CFG_RLDIEN_Pos                 (9U)
#define WWDT_CFG_RLDIEN_Msk                 (0x1U << WWDT_CFG_RLDIEN_Pos)           /*!< 0x00000200 */
#define WWDT_CFG_RLDIEN                     WWDT_CFG_RLDIEN_Msk                     /*!< Reload counter interrupt */

/*******************  Bit definition for WWDT_STS register  *******************/
#define WWDT_STS_RLDF_Pos                   (0U)
#define WWDT_STS_RLDF_Msk                   (0x1U << WWDT_STS_RLDF_Pos)             /*!< 0x00000001 */
#define WWDT_STS_RLDF                       WWDT_STS_RLDF_Msk                       /*!< Reload counter interrupt flag */

/******************************************************************************/
/*                                                                            */
/*                            Watchdog timer (WDT)                            */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for WDT_CMD register  ********************/
#define WDT_CMD_CMD_Pos                     (0U)
#define WDT_CMD_CMD_Msk                     (0xFFFFU << WDT_CMD_CMD_Pos)            /*!< 0x0000FFFF */
#define WDT_CMD_CMD                         WDT_CMD_CMD_Msk                         /*!< Command register */

/*******************  Bit definition for WDT_DIV register  ********************/
/*!< DIV configuration */
#define WDT_DIV_DIV_Pos                     (0U)
#define WDT_DIV_DIV_Msk                     (0x7U << WDT_DIV_DIV_Pos)               /*!< 0x00000007 */
#define WDT_DIV_DIV                         WDT_DIV_DIV_Msk                         /*!< DIV[2:0] (Clock division value) */
#define WDT_DIV_DIV_0                       (0x1U << WDT_DIV_DIV_Pos)               /*!< 0x00000001 */
#define WDT_DIV_DIV_1                       (0x2U << WDT_DIV_DIV_Pos)               /*!< 0x00000002 */
#define WDT_DIV_DIV_2                       (0x4U << WDT_DIV_DIV_Pos)               /*!< 0x00000004 */

/*******************  Bit definition for WDT_RLD register  ********************/
#define WDT_RLD_RLD_Pos                     (0U)
#define WDT_RLD_RLD_Msk                     (0xFFFU << WDT_RLD_RLD_Pos)             /*!< 0x00000FFF */
#define WDT_RLD_RLD                         WDT_RLD_RLD_Msk                         /*!< Reload value */

/*******************  Bit definition for WDT_STS register  ********************/
#define WDT_STS_DIVF_Pos                    (0U)
#define WDT_STS_DIVF_Msk                    (0x1U << WDT_STS_DIVF_Pos)              /*!< 0x00000001 */
#define WDT_STS_DIVF                        WDT_STS_DIVF_Msk                        /*!< Division value update complete flag */
#define WDT_STS_RLDF_Pos                    (1U)
#define WDT_STS_RLDF_Msk                    (0x1U << WDT_STS_RLDF_Pos)              /*!< 0x00000002 */
#define WDT_STS_RLDF                        WDT_STS_RLDF_Msk                        /*!< Reload value update complete flag */
#define WDT_STS_WINF_Pos                    (2U)
#define WDT_STS_WINF_Msk                    (0x1U << WDT_STS_WINF_Pos)              /*!< 0x00000004 */
#define WDT_STS_WINF                        WDT_STS_WINF_Msk                        /*!< Window value update complete flag */

/*******************  Bit definition for WDT_WIN register  ********************/
#define WDT_WIN_WIN_Pos                     (0U)
#define WDT_WIN_WIN_Msk                     (0xFFFU << WDT_WIN_WIN_Pos)             /*!< 0x00000FFF */
#define WDT_WIN_WIN                         WDT_WIN_WIN_Msk                         /*!< Window value */

/******************************************************************************/
/*                                                                            */
/*                     Analog-to-digital converter (ADC)                      */
/*                                                                            */
/******************************************************************************/

