ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/* Legacy defines */
#define ADC_CTRL1_CCEIEN                    (ADC_CTRL1_CCCIEN)
#define ADC_CTRL1_PCCEIEN                   (ADC_CTRL1_PCCCIEN)

/******************  Bit definition for ADC_CTRL2 register  *******************/
#define ADC_CTRL2_ADCEN_Pos                 (0U)
#define ADC_CTRL2_ADCEN_Msk                 (0x1U << ADC_CTRL2_ADCEN_Pos)           /*!< 0x00000001 */
#define ADC_CTRL2_ADCEN                     ADC_CTRL2_ADCEN_Msk                     /*!< A/D converter enable */
#define ADC_CTRL2_RPEN_Pos                  (1U)
#define ADC_CTRL2_RPEN_Msk                  (0x1U << ADC_CTRL2_RPEN_Pos)            /*!< 0x00000002 */
#define ADC_CTRL2_RPEN                      ADC_CTRL2_RPEN_Msk                      /*!< Repetition mode enable */
#define ADC_CTRL2_ADCAL_Pos                 (2U)
#define ADC_CTRL2_ADCAL_Msk                 (0x1U << ADC_CTRL2_ADCAL_Pos)           /*!< 0x00000004 */
#define ADC_CTRL2_ADCAL                     ADC_CTRL2_ADCAL_Msk                     /*!< A/D calibration */
#define ADC_CTRL2_ADCALINIT_Pos             (3U)
#define ADC_CTRL2_ADCALINIT_Msk             (0x1U << ADC_CTRL2_ADCALINIT_Pos)       /*!< 0x00000008 */
#define ADC_CTRL2_ADCALINIT                 ADC_CTRL2_ADCALINIT_Msk                 /*!< Initialize A/D calibration */
#define ADC_CTRL2_ADABRT_Pos                (4U)
#define ADC_CTRL2_ADABRT_Msk                (0x1U << ADC_CTRL2_ADABRT_Pos)          /*!< 0x00000010 */
#define ADC_CTRL2_ADABRT                    ADC_CTRL2_ADABRT_Msk                    /*!< ADC conversion abort */
#define ADC_CTRL2_OCDMAEN_Pos               (8U)
#define ADC_CTRL2_OCDMAEN_Msk               (0x1U << ADC_CTRL2_OCDMAEN_Pos)         /*!< 0x00000100 */
#define ADC_CTRL2_OCDMAEN                   ADC_CTRL2_OCDMAEN_Msk                   /*!< DMA transfer enable of ordinary channels */
#define ADC_CTRL2_OCDRCEN_Pos               (9U)
#define ADC_CTRL2_OCDRCEN_Msk               (0x1U << ADC_CTRL2_OCDRCEN_Pos)         /*!< 0x00000200 */
#define ADC_CTRL2_OCDRCEN                   ADC_CTRL2_OCDRCEN_Msk                   /*!< Ordinary channels DMA request continuation enable for independent mode */
#define ADC_CTRL2_EOCSFEN_Pos               (10U)
#define ADC_CTRL2_EOCSFEN_Msk               (0x1U << ADC_CTRL2_EOCSFEN_Pos)         /*!< 0x00000400 */
#define ADC_CTRL2_EOCSFEN                   ADC_CTRL2_EOCSFEN_Msk                   /*!< Each ordinary channel conversion set OCCE flag enable */
#define ADC_CTRL2_DTALIGN_Pos               (11U)
#define ADC_CTRL2_DTALIGN_Msk               (0x1U << ADC_CTRL2_DTALIGN_Pos)         /*!< 0x00000800 */
#define ADC_CTRL2_DTALIGN                   ADC_CTRL2_DTALIGN_Msk                   /*!< Data alignment */

/*!< PCTESEL configuration */
#define ADC_CTRL2_PCTESEL_Pos               (16U)
#define ADC_CTRL2_PCTESEL_Msk               ((0xFU << ADC_CTRL2_PCTESEL_Pos) | (0x1U << 23))         /*!< 0x008F0000 */
#define ADC_CTRL2_PCTESEL                   ADC_CTRL2_PCTESEL_Msk                   /*!< PCTESEL[4:0] bits Trigger event select for preempted channels conversion */
#define ADC_CTRL2_PCTESEL_0                 (0x1U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00010000 */
#define ADC_CTRL2_PCTESEL_1                 (0x2U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00020000 */
#define ADC_CTRL2_PCTESEL_2                 (0x4U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00040000 */
#define ADC_CTRL2_PCTESEL_3                 (0x8U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00080000 */
#define ADC_CTRL2_PCTESEL_4                 (0x1U << 23)                            /*!< 0x00800000 */
#define ADC_CTRL2_PCETE_Pos                 (20U)
#define ADC_CTRL2_PCETE_Msk                 (0x3U << ADC_CTRL2_PCETE_Pos)           /*!< 0x00300000 */
#define ADC_CTRL2_PCETE                     ADC_CTRL2_PCETE_Msk                     /*!< PCTESEL[1:0] bits Preempted channels external trigger edge select */
#define ADC_CTRL2_PCETE_0                   (0x1U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00100000 */
#define ADC_CTRL2_PCETE_1                   (0x2U << ADC_CTRL2_PCTESEL_Pos)         /*!< 0x00200000 */
#define ADC_CTRL2_PCETE_DISABLE             (0U)
#define ADC_CTRL2_PCETE_RISING              ADC_CTRL2_PCETE_0
#define ADC_CTRL2_PCETE_FALLING             ADC_CTRL2_PCETE_1
#define ADC_CTRL2_PCETE_ANY                 ADC_CTRL2_PCETE
#define ADC_CTRL2_PCTEN                     ADC_CTRL2_PCETE_RISING 
#define ADC_CTRL2_PCSWTRG_Pos               (22U)
#define ADC_CTRL2_PCSWTRG_Msk               (0x1U << ADC_CTRL2_PCSWTRG_Pos)         /*!< 0x00400000 */
#define ADC_CTRL2_PCSWTRG                   ADC_CTRL2_PCSWTRG_Msk                   /*!< Conversion of preempted channels triggered by software */

/*!< OCTESEL configuration */
#define ADC_CTRL2_OCTESEL_Pos               (24U)
#define ADC_CTRL2_OCTESEL_Msk               ((0xFU << ADC_CTRL2_OCTESEL_Pos)  | (0x1U << 31))         /*!< 0x8F000000 */
#define ADC_CTRL2_OCTESEL                   ADC_CTRL2_OCTESEL_Msk                   /*!< OCTESEL[4:0] bits Trigger event select for ordinary channels conversion */
#define ADC_CTRL2_OCTESEL_0                 (0x1U << ADC_CTRL2_OCTESEL_Pos)         /*!< 0x01000000 */
#define ADC_CTRL2_OCTESEL_1                 (0x2U << ADC_CTRL2_OCTESEL_Pos)         /*!< 0x02000000 */
#define ADC_CTRL2_OCTESEL_2                 (0x4U << ADC_CTRL2_OCTESEL_Pos)         /*!< 0x03000000 */
#define ADC_CTRL2_OCTESEL_3                 (0x8U << ADC_CTRL2_OCTESEL_Pos)         /*!< 0x04000000 */
#define ADC_CTRL2_OCTESEL_4                 (0x1U << 31)                            /*!< 0x80000000 */
#define ADC_CTRL2_OCETE_Pos                 (28U)
#define ADC_CTRL2_OCETE_Msk                 (0x3U << ADC_CTRL2_OCETE_Pos)           /*!< 0x30000000 */
#define ADC_CTRL2_OCETE                     ADC_CTRL2_OCETE_Msk                     /*!< OCETE[1:0] bitsO rdinary channels external trigger edge select */
#define ADC_CTRL2_OCETE_0                   (0x1U << ADC_CTRL2_OCETE_Pos)           /*!< 0x10000000 */
#define ADC_CTRL2_OCETE_1                   (0x2U << ADC_CTRL2_OCETE_Pos)           /*!< 0x20000000 */
#define ADC_CTRL2_OCETE_DISABLE             (0U)
#define ADC_CTRL2_OCETE_RISING              ADC_CTRL2_OCETE_0
#define ADC_CTRL2_OCETE_FALLING             ADC_CTRL2_OCETE_1
#define ADC_CTRL2_OCETE_ANY                 ADC_CTRL2_OCETE
#define ADC_CTRL2_OCTEN                     ADC_CTRL2_OCETE_RISING 
#define ADC_CTRL2_OCSWTRG_Pos               (30U)
#define ADC_CTRL2_OCSWTRG_Msk               (0x1U << ADC_CTRL2_OCSWTRG_Pos)         /*!< 0x00400000 */
#define ADC_CTRL2_OCSWTRG                   ADC_CTRL2_OCSWTRG_Msk                   /*!< Conversion of ordinary channels triggered by software */

/*******************  Bit definition for ADC_SPT1 register  *******************/
/*!< CSPT10 configuration */
#define ADC_SPT1_CSPT10_Pos                 (0U)
#define ADC_SPT1_CSPT10_Msk                 (0x7U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000007 */
#define ADC_SPT1_CSPT10                     ADC_SPT1_CSPT10_Msk                     /*!< CSPT10[2:0] bits (Sample time selection of channel ADC_IN10) */
#define ADC_SPT1_CSPT10_0                   (0x1U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000001 */
#define ADC_SPT1_CSPT10_1                   (0x2U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000002 */
#define ADC_SPT1_CSPT10_2                   (0x4U << ADC_SPT1_CSPT10_Pos)           /*!< 0x00000004 */

/*!< CSPT11 configuration */
#define ADC_SPT1_CSPT11_Pos                 (3U)
#define ADC_SPT1_CSPT11_Msk                 (0x7U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000038 */
#define ADC_SPT1_CSPT11                     ADC_SPT1_CSPT11_Msk                     /*!< CSPT11[2:0] bits (Sample time selection of channel ADC_IN11) */
#define ADC_SPT1_CSPT11_0                   (0x1U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000008 */
#define ADC_SPT1_CSPT11_1                   (0x2U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000010 */
#define ADC_SPT1_CSPT11_2                   (0x4U << ADC_SPT1_CSPT11_Pos)           /*!< 0x00000020 */

/*!< CSPT12 configuration */
#define ADC_SPT1_CSPT12_Pos                 (6U)
#define ADC_SPT1_CSPT12_Msk                 (0x7U << ADC_SPT1_CSPT12_Pos)           /*!< 0x000001C0 */
#define ADC_SPT1_CSPT12                     ADC_SPT1_CSPT12_Msk                     /*!< CSPT12[2:0] bits (Sample time selection of channel ADC_IN12) */
#define ADC_SPT1_CSPT12_0                   (0x1U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000040 */
#define ADC_SPT1_CSPT12_1                   (0x2U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000080 */
#define ADC_SPT1_CSPT12_2                   (0x4U << ADC_SPT1_CSPT12_Pos)           /*!< 0x00000100 */

/*!< CSPT13 configuration */
#define ADC_SPT1_CSPT13_Pos                 (9U)
#define ADC_SPT1_CSPT13_Msk                 (0x7U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000E00 */
#define ADC_SPT1_CSPT13                     ADC_SPT1_CSPT13_Msk                     /*!< CSPT13[2:0] bits (Sample time selection of channel ADC_IN13) */
#define ADC_SPT1_CSPT13_0                   (0x1U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000200 */
#define ADC_SPT1_CSPT13_1                   (0x2U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000400 */
#define ADC_SPT1_CSPT13_2                   (0x4U << ADC_SPT1_CSPT13_Pos)           /*!< 0x00000800 */

/*!< CSPT14 configuration */
#define ADC_SPT1_CSPT14_Pos                 (12U)
#define ADC_SPT1_CSPT14_Msk                 (0x7U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00007000 */
#define ADC_SPT1_CSPT14                     ADC_SPT1_CSPT14_Msk                     /*!< CSPT14[2:0] bits (Sample time selection of channel ADC_IN14) */
#define ADC_SPT1_CSPT14_0                   (0x1U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00001000 */
#define ADC_SPT1_CSPT14_1                   (0x2U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00002000 */
#define ADC_SPT1_CSPT14_2                   (0x4U << ADC_SPT1_CSPT14_Pos)           /*!< 0x00004000 */

/*!< CSPT15 configuration */
#define ADC_SPT1_CSPT15_Pos                 (15U)
#define ADC_SPT1_CSPT15_Msk                 (0x7U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00038000 */
#define ADC_SPT1_CSPT15                     ADC_SPT1_CSPT15_Msk                     /*!< CSPT15[2:0] bits (Sample time selection of channel ADC_IN15) */
#define ADC_SPT1_CSPT15_0                   (0x1U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00008000 */
#define ADC_SPT1_CSPT15_1                   (0x2U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00010000 */
#define ADC_SPT1_CSPT15_2                   (0x4U << ADC_SPT1_CSPT15_Pos)           /*!< 0x00020000 */

/*!< CSPT16 configuration */
#define ADC_SPT1_CSPT16_Pos                 (18U)
#define ADC_SPT1_CSPT16_Msk                 (0x7U << ADC_SPT1_CSPT16_Pos)           /*!< 0x001C0000 */
#define ADC_SPT1_CSPT16                     ADC_SPT1_CSPT16_Msk                     /*!< CSPT16[2:0] bits (Sample time selection of channel ADC_IN16) */
#define ADC_SPT1_CSPT16_0                   (0x1U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00040000 */
#define ADC_SPT1_CSPT16_1                   (0x2U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00080000 */
#define ADC_SPT1_CSPT16_2                   (0x4U << ADC_SPT1_CSPT16_Pos)           /*!< 0x00100000 */

