ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/*!< OCLEN configuration */
#define ADC_OSQ1_OCLEN_Pos                  (20U)
#define ADC_OSQ1_OCLEN_Msk                  (0xFU << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00F00000 */
#define ADC_OSQ1_OCLEN                      ADC_OSQ1_OCLEN_Msk                      /*!< OCLEN[3:0] bits (Ordinary conversion sequence length) */
#define ADC_OSQ1_OCLEN_0                    (0x1U << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00100000 */
#define ADC_OSQ1_OCLEN_1                    (0x2U << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00200000 */
#define ADC_OSQ1_OCLEN_2                    (0x4U << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00400000 */
#define ADC_OSQ1_OCLEN_3                    (0x8U << ADC_OSQ1_OCLEN_Pos)            /*!< 0x00800000 */

/*******************  Bit definition for ADC_OSQ2 register  *******************/
/*!< OSN7 configuration */
#define ADC_OSQ2_OSN7_Pos                   (0U)
#define ADC_OSQ2_OSN7_Msk                   (0x1FU << ADC_OSQ2_OSN7_Pos)            /*!< 0x0000001F */
#define ADC_OSQ2_OSN7                       ADC_OSQ2_OSN7_Msk                       /*!< OSN7[4:0] bits (Number of 7th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN7_0                     (0x01U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000001 */
#define ADC_OSQ2_OSN7_1                     (0x02U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000002 */
#define ADC_OSQ2_OSN7_2                     (0x04U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000004 */
#define ADC_OSQ2_OSN7_3                     (0x08U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000008 */
#define ADC_OSQ2_OSN7_4                     (0x10U << ADC_OSQ2_OSN7_Pos)            /*!< 0x00000010 */

/*!< OSN8 configuration */
#define ADC_OSQ2_OSN8_Pos                   (5U)
#define ADC_OSQ2_OSN8_Msk                   (0x1FU << ADC_OSQ2_OSN8_Pos)            /*!< 0x000003E0 */
#define ADC_OSQ2_OSN8                       ADC_OSQ2_OSN8_Msk                       /*!< OSN8[4:0] bits (Number of 8th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN8_0                     (0x01U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000020 */
#define ADC_OSQ2_OSN8_1                     (0x02U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000040 */
#define ADC_OSQ2_OSN8_2                     (0x04U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000080 */
#define ADC_OSQ2_OSN8_3                     (0x08U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000100 */
#define ADC_OSQ2_OSN8_4                     (0x10U << ADC_OSQ2_OSN8_Pos)            /*!< 0x00000200 */

/*!< OSN9 configuration */
#define ADC_OSQ2_OSN9_Pos                   (10U)
#define ADC_OSQ2_OSN9_Msk                   (0x1FU << ADC_OSQ2_OSN9_Pos)            /*!< 0x00007C00 */
#define ADC_OSQ2_OSN9                       ADC_OSQ2_OSN9_Msk                       /*!< OSN9[4:0] bits (Number of 9th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN9_0                     (0x01U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00000400 */
#define ADC_OSQ2_OSN9_1                     (0x02U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00000800 */
#define ADC_OSQ2_OSN9_2                     (0x04U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00001000 */
#define ADC_OSQ2_OSN9_3                     (0x08U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00002000 */
#define ADC_OSQ2_OSN9_4                     (0x10U << ADC_OSQ2_OSN9_Pos)            /*!< 0x00004000 */

/*!< OSN10 configuration */
#define ADC_OSQ2_OSN10_Pos                  (15U)
#define ADC_OSQ2_OSN10_Msk                  (0x1FU << ADC_OSQ2_OSN10_Pos)           /*!< 0x000F8000 */
#define ADC_OSQ2_OSN10                      ADC_OSQ2_OSN10_Msk                      /*!< OSN10[4:0] bits (Number of 10th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN10_0                    (0x01U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00008000 */
#define ADC_OSQ2_OSN10_1                    (0x02U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00010000 */
#define ADC_OSQ2_OSN10_2                    (0x04U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00020000 */
#define ADC_OSQ2_OSN10_3                    (0x08U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00040000 */
#define ADC_OSQ2_OSN10_4                    (0x10U << ADC_OSQ2_OSN10_Pos)           /*!< 0x00080000 */

/*!< OSN11 configuration */
#define ADC_OSQ2_OSN11_Pos                  (20U)
#define ADC_OSQ2_OSN11_Msk                  (0x1FU << ADC_OSQ2_OSN11_Pos)           /*!< 0x01F00000 */
#define ADC_OSQ2_OSN11                      ADC_OSQ2_OSN11_Msk                      /*!< OSN11[4:0] bits (Number of 11th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN11_0                    (0x01U << ADC_OSQ2_OSN11_Pos)           /*!< 0x00100000 */
#define ADC_OSQ2_OSN11_1                    (0x02U << ADC_OSQ2_OSN11_Pos)           /*!< 0x00200000 */
#define ADC_OSQ2_OSN11_2                    (0x04U << ADC_OSQ2_OSN11_Pos)           /*!< 0x00400000 */
#define ADC_OSQ2_OSN11_3                    (0x08U << ADC_OSQ2_OSN11_Pos)           /*!< 0x00800000 */
#define ADC_OSQ2_OSN11_4                    (0x10U << ADC_OSQ2_OSN11_Pos)           /*!< 0x01000000 */

/*!< OSN12 configuration */
#define ADC_OSQ2_OSN12_Pos                  (25U)
#define ADC_OSQ2_OSN12_Msk                  (0x1FU << ADC_OSQ2_OSN12_Pos)           /*!< 0x3E000000 */
#define ADC_OSQ2_OSN12                      ADC_OSQ2_OSN12_Msk                      /*!< OSN12[4:0] bits (Number of 12th conversion in ordinary sequence) */
#define ADC_OSQ2_OSN12_0                    (0x01U << ADC_OSQ2_OSN12_Pos)           /*!< 0x02000000 */
#define ADC_OSQ2_OSN12_1                    (0x02U << ADC_OSQ2_OSN12_Pos)           /*!< 0x04000000 */
#define ADC_OSQ2_OSN12_2                    (0x04U << ADC_OSQ2_OSN12_Pos)           /*!< 0x08000000 */
#define ADC_OSQ2_OSN12_3                    (0x08U << ADC_OSQ2_OSN12_Pos)           /*!< 0x10000000 */
#define ADC_OSQ2_OSN12_4                    (0x10U << ADC_OSQ2_OSN12_Pos)           /*!< 0x20000000 */

/*******************  Bit definition for ADC_OSQ3 register  *******************/
/*!< OSN1 configuration */
#define ADC_OSQ3_OSN1_Pos                   (0U)
#define ADC_OSQ3_OSN1_Msk                   (0x1FU << ADC_OSQ3_OSN1_Pos)            /*!< 0x0000001F */
#define ADC_OSQ3_OSN1                       ADC_OSQ3_OSN1_Msk                       /*!< OSN1[4:0] bits (Number of 1st conversion in ordinary sequence) */
#define ADC_OSQ3_OSN1_0                     (0x01U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000001 */
#define ADC_OSQ3_OSN1_1                     (0x02U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000002 */
#define ADC_OSQ3_OSN1_2                     (0x04U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000004 */
#define ADC_OSQ3_OSN1_3                     (0x08U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000008 */
#define ADC_OSQ3_OSN1_4                     (0x10U << ADC_OSQ3_OSN1_Pos)            /*!< 0x00000010 */

/*!< OSN2 configuration */
#define ADC_OSQ3_OSN2_Pos                   (5U)
#define ADC_OSQ3_OSN2_Msk                   (0x1FU << ADC_OSQ3_OSN2_Pos)            /*!< 0x000003E0 */
#define ADC_OSQ3_OSN2                       ADC_OSQ3_OSN2_Msk                       /*!< OSN2[4:0] bits (Number of 2nd conversion in ordinary sequence) */
#define ADC_OSQ3_OSN2_0                     (0x01U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000020 */
#define ADC_OSQ3_OSN2_1                     (0x02U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000040 */
#define ADC_OSQ3_OSN2_2                     (0x04U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000080 */
#define ADC_OSQ3_OSN2_3                     (0x08U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000100 */
#define ADC_OSQ3_OSN2_4                     (0x10U << ADC_OSQ3_OSN2_Pos)            /*!< 0x00000200 */

/*!< OSN3 configuration */
#define ADC_OSQ3_OSN3_Pos                   (10U)
#define ADC_OSQ3_OSN3_Msk                   (0x1FU << ADC_OSQ3_OSN3_Pos)            /*!< 0x00007C00 */
#define ADC_OSQ3_OSN3                       ADC_OSQ3_OSN3_Msk                       /*!< OSN3[4:0] bits (Number of 3rd conversion in ordinary sequence) */
#define ADC_OSQ3_OSN3_0                     (0x01U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00000400 */
#define ADC_OSQ3_OSN3_1                     (0x02U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00000800 */
#define ADC_OSQ3_OSN3_2                     (0x04U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00001000 */
#define ADC_OSQ3_OSN3_3                     (0x08U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00002000 */
#define ADC_OSQ3_OSN3_4                     (0x10U << ADC_OSQ3_OSN3_Pos)            /*!< 0x00004000 */

/*!< OSN4 configuration */
#define ADC_OSQ3_OSN4_Pos                   (15U)
#define ADC_OSQ3_OSN4_Msk                   (0x1FU << ADC_OSQ3_OSN4_Pos)            /*!< 0x000F8000 */
#define ADC_OSQ3_OSN4                       ADC_OSQ3_OSN4_Msk                       /*!< OSN4[4:0] bits (Number of 4th conversion in ordinary sequence) */
#define ADC_OSQ3_OSN4_0                     (0x01U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00008000 */
#define ADC_OSQ3_OSN4_1                     (0x02U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00010000 */
#define ADC_OSQ3_OSN4_2                     (0x04U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00020000 */
#define ADC_OSQ3_OSN4_3                     (0x08U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00040000 */
#define ADC_OSQ3_OSN4_4                     (0x10U << ADC_OSQ3_OSN4_Pos)            /*!< 0x00080000 */

/*!< OSN5 configuration */
#define ADC_OSQ3_OSN5_Pos                   (20U)
#define ADC_OSQ3_OSN5_Msk                   (0x1FU << ADC_OSQ3_OSN5_Pos)            /*!< 0x01F00000 */
#define ADC_OSQ3_OSN5                       ADC_OSQ3_OSN5_Msk                       /*!< OSN5[4:0] bits (Number of 5th conversion in ordinary sequence) */
#define ADC_OSQ3_OSN5_0                     (0x01U << ADC_OSQ3_OSN5_Pos)            /*!< 0x00100000 */
#define ADC_OSQ3_OSN5_1                     (0x02U << ADC_OSQ3_OSN5_Pos)            /*!< 0x00200000 */
#define ADC_OSQ3_OSN5_2                     (0x04U << ADC_OSQ3_OSN5_Pos)            /*!< 0x00400000 */
#define ADC_OSQ3_OSN5_3                     (0x08U << ADC_OSQ3_OSN5_Pos)            /*!< 0x00800000 */
#define ADC_OSQ3_OSN5_4                     (0x10U << ADC_OSQ3_OSN5_Pos)            /*!< 0x01000000 */

/*!< OSN6 configuration */
#define ADC_OSQ3_OSN6_Pos                   (25U)
#define ADC_OSQ3_OSN6_Msk                   (0x1FU << ADC_OSQ3_OSN6_Pos)            /*!< 0x3E000000 */
#define ADC_OSQ3_OSN6                       ADC_OSQ3_OSN6_Msk                       /*!< OSN6[4:0] bits (Number of 6th conversion in ordinary sequence) */
#define ADC_OSQ3_OSN6_0                     (0x01U << ADC_OSQ3_OSN6_Pos)            /*!< 0x02000000 */
#define ADC_OSQ3_OSN6_1                     (0x02U << ADC_OSQ3_OSN6_Pos)            /*!< 0x04000000 */
#define ADC_OSQ3_OSN6_2                     (0x04U << ADC_OSQ3_OSN6_Pos)            /*!< 0x08000000 */
#define ADC_OSQ3_OSN6_3                     (0x08U << ADC_OSQ3_OSN6_Pos)            /*!< 0x10000000 */
#define ADC_OSQ3_OSN6_4                     (0x10U << ADC_OSQ3_OSN6_Pos)            /*!< 0x20000000 */

/*******************  Bit definition for ADC_PSQ register  ********************/
/*!< PSN1 configuration */
#define ADC_PSQ_PSN1_Pos                    (0U)
#define ADC_PSQ_PSN1_Msk                    (0x1FU << ADC_PSQ_PSN1_Pos)             /*!< 0x0000001F */
#define ADC_PSQ_PSN1                        ADC_PSQ_PSN1_Msk                        /*!< PSN1[4:0] bits (Number of 1st conversion in preempted sequence) */
#define ADC_PSQ_PSN1_0                      (0x01U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000001 */
#define ADC_PSQ_PSN1_1                      (0x02U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000002 */
#define ADC_PSQ_PSN1_2                      (0x04U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000004 */
#define ADC_PSQ_PSN1_3                      (0x08U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000008 */
#define ADC_PSQ_PSN1_4                      (0x10U << ADC_PSQ_PSN1_Pos)             /*!< 0x00000010 */

/*!< PSN2 configuration */
#define ADC_PSQ_PSN2_Pos                    (5U)
#define ADC_PSQ_PSN2_Msk                    (0x1FU << ADC_PSQ_PSN2_Pos)             /*!< 0x000003E0 */
#define ADC_PSQ_PSN2                        ADC_PSQ_PSN2_Msk                        /*!< PSN2[4:0] bits (Number of 2nd conversion in preempted sequence) */
#define ADC_PSQ_PSN2_0                      (0x01U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000020 */
#define ADC_PSQ_PSN2_1                      (0x02U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000040 */
#define ADC_PSQ_PSN2_2                      (0x04U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000080 */
#define ADC_PSQ_PSN2_3                      (0x08U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000100 */
#define ADC_PSQ_PSN2_4                      (0x10U << ADC_PSQ_PSN2_Pos)             /*!< 0x00000200 */

