ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
/*!< PSN3 configuration */
#define ADC_PSQ_PSN3_Pos                    (10U)
#define ADC_PSQ_PSN3_Msk                    (0x1FU << ADC_PSQ_PSN3_Pos)             /*!< 0x00007C00 */
#define ADC_PSQ_PSN3                        ADC_PSQ_PSN3_Msk                        /*!< PSN3[4:0] bits (Number of 3rd conversion in preempted sequence) */
#define ADC_PSQ_PSN3_0                      (0x01U << ADC_PSQ_PSN3_Pos)             /*!< 0x00000400 */
#define ADC_PSQ_PSN3_1                      (0x02U << ADC_PSQ_PSN3_Pos)             /*!< 0x00000800 */
#define ADC_PSQ_PSN3_2                      (0x04U << ADC_PSQ_PSN3_Pos)             /*!< 0x00001000 */
#define ADC_PSQ_PSN3_3                      (0x08U << ADC_PSQ_PSN3_Pos)             /*!< 0x00002000 */
#define ADC_PSQ_PSN3_4                      (0x10U << ADC_PSQ_PSN3_Pos)             /*!< 0x00004000 */

/*!< PSN4 configuration */
#define ADC_PSQ_PSN4_Pos                    (15U)
#define ADC_PSQ_PSN4_Msk                    (0x1FU << ADC_PSQ_PSN4_Pos)             /*!< 0x000F8000 */
#define ADC_PSQ_PSN4                        ADC_PSQ_PSN4_Msk                        /*!< PSN4[4:0] bits (Number of 4th conversion in preempted sequence) */
#define ADC_PSQ_PSN4_0                      (0x01U << ADC_PSQ_PSN4_Pos)             /*!< 0x00008000 */
#define ADC_PSQ_PSN4_1                      (0x02U << ADC_PSQ_PSN4_Pos)             /*!< 0x00010000 */
#define ADC_PSQ_PSN4_2                      (0x04U << ADC_PSQ_PSN4_Pos)             /*!< 0x00020000 */
#define ADC_PSQ_PSN4_3                      (0x08U << ADC_PSQ_PSN4_Pos)             /*!< 0x00040000 */
#define ADC_PSQ_PSN4_4                      (0x10U << ADC_PSQ_PSN4_Pos)             /*!< 0x00080000 */

/*!< PCLEN configuration */
#define ADC_PSQ_PCLEN_Pos                   (20U)
#define ADC_PSQ_PCLEN_Msk                   (0x3U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00300000 */
#define ADC_PSQ_PCLEN                       ADC_PSQ_PCLEN_Msk                       /*!< PCLEN[1:0] bits (Preempted conversion sequence length) */
#define ADC_PSQ_PCLEN_0                     (0x1U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00100000 */
#define ADC_PSQ_PCLEN_1                     (0x2U << ADC_PSQ_PCLEN_Pos)             /*!< 0x00200000 */

/*******************  Bit definition for ADC_PDT1 register  *******************/
#define ADC_PDT1_PDT1_Pos                   (0U)
#define ADC_PDT1_PDT1_Msk                   (0xFFFFU << ADC_PDT1_PDT1_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT1_PDT1                       ADC_PDT1_PDT1_Msk                       /*!< Conversion data from preempted channel 1 */

/*******************  Bit definition for ADC_PDT2 register  *******************/
#define ADC_PDT2_PDT2_Pos                   (0U)
#define ADC_PDT2_PDT2_Msk                   (0xFFFFU << ADC_PDT2_PDT2_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT2_PDT2                       ADC_PDT2_PDT2_Msk                       /*!< Conversion data from preempted channel 2 */

/*******************  Bit definition for ADC_PDT3 register  *******************/
#define ADC_PDT3_PDT3_Pos                   (0U)
#define ADC_PDT3_PDT3_Msk                   (0xFFFFU << ADC_PDT3_PDT3_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT3_PDT3                       ADC_PDT3_PDT3_Msk                       /*!< Conversion data from preempted channel 3 */

/*******************  Bit definition for ADC_PDT4 register  *******************/
#define ADC_PDT4_PDT4_Pos                   (0U)
#define ADC_PDT4_PDT4_Msk                   (0xFFFFU << ADC_PDT4_PDT4_Pos)          /*!< 0x0000FFFF */
#define ADC_PDT4_PDT4                       ADC_PDT4_PDT4_Msk                       /*!< Conversion data from preempted channel 4 */

/*******************  Bit definition for ADC_ODT register  ********************/
#define ADC_ODT_ODT_Pos                     (0U)
#define ADC_ODT_ODT_Msk                     (0xFFFFU << ADC_ODT_ODT_Pos)            /*!< 0x0000FFFF */
#define ADC_ODT_ODT                         ADC_ODT_ODT_Msk                         /*!< Conversion data of ordinary channel */

/*******************  Bit definition for ADC_OVSP register  *******************/
#define ADC_OVSP_OOSEN_Pos                  (0U)
#define ADC_OVSP_OOSEN_Msk                  (0x1U << ADC_OVSP_OOSEN_Pos)            /*!< 0x00000001 */
#define ADC_OVSP_OOSEN                      ADC_OVSP_OOSEN_Msk                      /*!< Ordinary oversampling enable */
#define ADC_OVSP_POSEN_Pos                  (1U)
#define ADC_OVSP_POSEN_Msk                  (0x1U << ADC_OVSP_POSEN_Pos)            /*!< 0x00000002 */
#define ADC_OVSP_POSEN                      ADC_OVSP_POSEN_Msk                      /*!< Preempted oversampling enable */

/*!< OSRSEL configuration */
#define ADC_OVSP_OSRSEL_Pos                 (2U)
#define ADC_OVSP_OSRSEL_Msk                 (0x7U << ADC_OVSP_OSRSEL_Pos)           /*!< 0x0000001C */
#define ADC_OVSP_OSRSEL                     ADC_OVSP_OSRSEL_Msk                     /*!< OSRSEL[2:0] bits (Oversampling ratio select) */
#define ADC_OVSP_OSRSEL_0                   (0x1U << ADC_OVSP_OSRSEL_Pos)           /*!< 0x00000004 */
#define ADC_OVSP_OSRSEL_1                   (0x2U << ADC_OVSP_OSRSEL_Pos)           /*!< 0x00000008 */
#define ADC_OVSP_OSRSEL_2                   (0x4U << ADC_OVSP_OSRSEL_Pos)           /*!< 0x00000010 */

#define ADC_OVSP_OSRSEL_MULTI2              0x00000000U                             /*!< 2x */
#define ADC_OVSP_OSRSEL_MULTI4              0x00000004U                             /*!< 4x */
#define ADC_OVSP_OSRSEL_MULTI8              0x00000008U                             /*!< 8x */
#define ADC_OVSP_OSRSEL_MULTI16             0x0000000CU                             /*!< 16x */
#define ADC_OVSP_OSRSEL_MULTI32             0x00000010U                             /*!< 32x */
#define ADC_OVSP_OSRSEL_MULTI64             0x00000014U                             /*!< 64x */
#define ADC_OVSP_OSRSEL_MULTI128            0x00000018U                             /*!< 128x */
#define ADC_OVSP_OSRSEL_MULTI256            0x0000001CU                             /*!< 256x */

/*!< OSSSEL configuration */
#define ADC_OVSP_OSSSEL_Pos                 (5U)
#define ADC_OVSP_OSSSEL_Msk                 (0xFU << ADC_OVSP_OSSSEL_Pos)           /*!< 0x000001E0 */
#define ADC_OVSP_OSSSEL                     ADC_OVSP_OSSSEL_Msk                     /*!< OSSSEL[3:0] bits (Oversampling shift select) */
#define ADC_OVSP_OSSSEL_0                   (0x1U << ADC_OVSP_OSSSEL_Pos)           /*!< 0x00000020 */
#define ADC_OVSP_OSSSEL_1                   (0x2U << ADC_OVSP_OSSSEL_Pos)           /*!< 0x00000040 */
#define ADC_OVSP_OSSSEL_2                   (0x4U << ADC_OVSP_OSSSEL_Pos)           /*!< 0x00000080 */
#define ADC_OVSP_OSSSEL_3                   (0x8U << ADC_OVSP_OSSSEL_Pos)           /*!< 0x00000100 */

#define ADC_OVSP_OSSSEL_NOSHIFT             0x00000000U                             /*!< No shift */
#define ADC_OVSP_OSSSEL_SHIFT1              0x00000020U                             /*!< Shift 1 bit */
#define ADC_OVSP_OSSSEL_SHIFT2              0x00000040U                             /*!< Shift 2 bit */
#define ADC_OVSP_OSSSEL_SHIFT3              0x00000060U                             /*!< Shift 3 bit */
#define ADC_OVSP_OSSSEL_SHIFT4              0x00000080U                             /*!< Shift 4 bit */
#define ADC_OVSP_OSSSEL_SHIFT5              0x000000A0U                             /*!< Shift 5 bit */
#define ADC_OVSP_OSSSEL_SHIFT6              0x000000C0U                             /*!< Shift 6 bit */
#define ADC_OVSP_OSSSEL_SHIFT7              0x000000E0U                             /*!< Shift 7 bit */
#define ADC_OVSP_OSSSEL_SHIFT8              0x00000100U                             /*!< Shift 8 bit */

#define ADC_OVSP_OOSTREN_Pos                (9U)
#define ADC_OVSP_OOSTREN_Msk                (0x1U << ADC_OVSP_OOSTREN_Pos)          /*!< 0x00000200 */
#define ADC_OVSP_OOSTREN                    ADC_OVSP_OOSTREN_Msk                    /*!< Ordinary oversampling trigger mode enable */
#define ADC_OVSP_OOSRSEL_Pos                (10U)
#define ADC_OVSP_OOSRSEL_Msk                (0x1U << ADC_OVSP_OOSRSEL_Pos)          /*!< 0x00000400 */
#define ADC_OVSP_OOSRSEL                    ADC_OVSP_OOSRSEL_Msk                    /*!< Ordinary oversampling restart mode select */

/*******************  Bit definition for ADC_CALVAL register  ********************/
#define ADC_CALVAL_CALVAL_Pos               (0U)
#define ADC_CALVAL_CALVA_Msk                (0x7FU << ADC_CALVAL_CALVAL_Pos)        /*!< 0x0000007F */
#define ADC_CALVAL_CALVA                    ADC_CALVAL_CALVA_Msk                    /*!< A/D Calibration value */

/*******************  Bit definition for ADC_CSTS register  ********************/
#define ADC_CSTS_VMOR1_Pos                  (0U)
#define ADC_CSTS_VMOR1_Msk                  (0x1U << ADC_CSTS_VMOR1_Pos)            /*!< 0x00000001 */
#define ADC_CSTS_VMOR1                      ADC_CSTS_VMOR1_Msk                      /*!< Voltage monitoring out of range flag of ADC1 */
#define ADC_CSTS_OCCE1_Pos                  (1U)
#define ADC_CSTS_OCCE1_Msk                  (0x1U << ADC_CSTS_OCCE1_Pos)            /*!< 0x00000002 */
#define ADC_CSTS_OCCE1                      ADC_CSTS_OCCE1_Msk                      /*!< Ordinary channels conversion end flag of ADC1 */
#define ADC_CSTS_PCCE1_Pos                  (2U)
#define ADC_CSTS_PCCE1_Msk                  (0x1U << ADC_CSTS_PCCE1_Pos)            /*!< 0x00000004 */
#define ADC_CSTS_PCCE1                      ADC_CSTS_PCCE1_Msk                      /*!< preempted channels conversion end flag of ADC1 */
#define ADC_CSTS_PCCS1_Pos                  (3U)
#define ADC_CSTS_PCCS1_Msk                  (0x1U << ADC_CSTS_PCCS1_Pos)            /*!< 0x00000008 */
#define ADC_CSTS_PCCS1                      ADC_CSTS_PCCS1_Msk                      /*!< ADC1 Preempted channel conversion start flag */
#define ADC_CSTS_OCCS1_Pos                  (4U)
#define ADC_CSTS_OCCS1_Msk                  (0x1U << ADC_CSTS_OCCS1_Pos)            /*!< 0x00000010 */
#define ADC_CSTS_OCCS1                      ADC_CSTS_OCCS1_Msk                      /*!< ADC1 ordinary channel conversion start flag */
#define ADC_CSTS_OCCO1_Pos                  (5U)
#define ADC_CSTS_OCCO1_Msk                  (0x1U << ADC_CSTS_OCCO1_Pos)            /*!< 0x00000020 */
#define ADC_CSTS_OCCO1                      ADC_CSTS_OCCO1_Msk                      /*!< ADC1 ordinary channel conversion overflow flag */
#define ADC_CSTS_RDY1_Pos                   (6U)
#define ADC_CSTS_RDY1_Msk                   (0x1U << ADC_CSTS_RDY1_Pos)             /*!< 0x00000040 */
#define ADC_CSTS_RDY1                       ADC_CSTS_RDY1_Msk                       /*!< ADC1 conversion ready flag */
#define ADC_CSTS_VMOR2_Pos                  (8U)
#define ADC_CSTS_VMOR2_Msk                  (0x1U << ADC_CSTS_VMOR2_Pos)            /*!< 0x00000100 */
#define ADC_CSTS_VMOR2                      ADC_CSTS_VMOR2_Msk                      /*!< Voltage monitoring out of range flag of ADC2 */
#define ADC_CSTS_OCCE2_Pos                  (9U)
#define ADC_CSTS_OCCE2_Msk                  (0x1U << ADC_CSTS_OCCE2_Pos)            /*!< 0x00000200 */
#define ADC_CSTS_OCCE2                      ADC_CSTS_OCCE2_Msk                      /*!< Ordinary channels conversion end flag of ADC2 */
#define ADC_CSTS_PCCE2_Pos                  (10U)
#define ADC_CSTS_PCCE2_Msk                  (0x1U << ADC_CSTS_PCCE2_Pos)            /*!< 0x00000400 */
#define ADC_CSTS_PCCE2                      ADC_CSTS_PCCE2_Msk                      /*!< preempted channels conversion end flag of ADC2 */
#define ADC_CSTS_PCCS2_Pos                  (11U)
#define ADC_CSTS_PCCS2_Msk                  (0x1U << ADC_CSTS_PCCS2_Pos)            /*!< 0x00000800 */
#define ADC_CSTS_PCCS2                      ADC_CSTS_PCCS2_Msk                      /*!< ADC2 Preempted channel conversion start flag */
#define ADC_CSTS_OCCS2_Pos                  (12U)
#define ADC_CSTS_OCCS2_Msk                  (0x1U << ADC_CSTS_OCCS2_Pos)            /*!< 0x00001000 */
#define ADC_CSTS_OCCS2                      ADC_CSTS_OCCS2_Msk                      /*!< ADC2 ordinary channel conversion start flag */
#define ADC_CSTS_OCCO2_Pos                  (13U)
#define ADC_CSTS_OCCO2_Msk                  (0x1U << ADC_CSTS_OCCO2_Pos)            /*!< 0x00002000 */
#define ADC_CSTS_OCCO2                      ADC_CSTS_OCCO2_Msk                      /*!< ADC2 ordinary channel conversion overflow flag */
#define ADC_CSTS_RDY2_Pos                   (14U)
#define ADC_CSTS_RDY2_Msk                   (0x1U << ADC_CSTS_RDY2_Pos)             /*!< 0x00004000 */
#define ADC_CSTS_RDY2                       ADC_CSTS_RDY2_Msk                       /*!< ADC2 conversion ready flag */
#define ADC_CSTS_VMOR3_Pos                  (16U)
#define ADC_CSTS_VMOR3_Msk                  (0x1U << ADC_CSTS_VMOR3_Pos)            /*!< 0x00010000 */
#define ADC_CSTS_VMOR3                      ADC_CSTS_VMOR3_Msk                      /*!< Voltage monitoring out of range flag of ADC3 */
#define ADC_CSTS_OCCE3_Pos                  (17U)
#define ADC_CSTS_OCCE3_Msk                  (0x1U << ADC_CSTS_OCCE3_Pos)            /*!< 0x00020000 */
#define ADC_CSTS_OCCE3                      ADC_CSTS_OCCE3_Msk                      /*!< Ordinary channels conversion end flag of ADC3 */
#define ADC_CSTS_PCCE3_Pos                  (18U)
#define ADC_CSTS_PCCE3_Msk                  (0x1U << ADC_CSTS_PCCE3_Pos)            /*!< 0x00040000 */
#define ADC_CSTS_PCCE3                      ADC_CSTS_PCCE3_Msk                      /*!< preempted channels conversion end flag of ADC3 */
#define ADC_CSTS_PCCS3_Pos                  (19U)
#define ADC_CSTS_PCCS3_Msk                  (0x1U << ADC_CSTS_PCCS3_Pos)            /*!< 0x00080000 */
#define ADC_CSTS_PCCS3                      ADC_CSTS_PCCS3_Msk                      /*!< ADC3 Preempted channel conversion start flag */
#define ADC_CSTS_OCCS3_Pos                  (20U)
#define ADC_CSTS_OCCS3_Msk                  (0x1U << ADC_CSTS_OCCS3_Pos)            /*!< 0x00100000 */
#define ADC_CSTS_OCCS3                      ADC_CSTS_OCCS3_Msk                      /*!< ADC3 ordinary channel conversion start flag */
#define ADC_CSTS_OCCO3_Pos                  (21U)
#define ADC_CSTS_OCCO3_Msk                  (0x1U << ADC_CSTS_OCCO3_Pos)            /*!< 0x00200000 */
#define ADC_CSTS_OCCO3                      ADC_CSTS_OCCO3_Msk                      /*!< ADC3 ordinary channel conversion overflow flag */
#define ADC_CSTS_RDY3_Pos                   (22U)
#define ADC_CSTS_RDY3_Msk                   (0x1U << ADC_CSTS_RDY3_Pos)             /*!< 0x00400000 */
#define ADC_CSTS_RDY3                       ADC_CSTS_RDY3_Msk                       /*!< ADC3 conversion ready flag */

/******************  Bit definition for ADC_CCTRL register  *******************/
/*!< ADC Master slave mode select */
#define ADC_CCTRL_MSSEL_Pos                 (0U)
#define ADC_CCTRL_MSSEL_Msk                 (0x1FU << ADC_CCTRL_MSSEL_Pos)          /*!< 0x0000001F */
#define ADC_CCTRL_MSSEL                     ADC_CCTRL_MSSEL_Msk                     /*!< MSSEL[4:0] bits Master slave mode select */
#define ADC_CCTRL_MSSEL_0                   (0x1U << ADC_CCTRL_MSSEL_Pos)           /*!< 0x00000001 */
#define ADC_CCTRL_MSSEL_1                   (0x2U << ADC_CCTRL_MSSEL_Pos)           /*!< 0x00000002 */
#define ADC_CCTRL_MSSEL_2                   (0x4U << ADC_CCTRL_MSSEL_Pos)           /*!< 0x00000004 */
#define ADC_CCTRL_MSSEL_3                   (0x8U << ADC_CCTRL_MSSEL_Pos)           /*!< 0x00000008 */
#define ADC_CCTRL_MSSEL_4                   (0x10U << ADC_CCTRL_MSSEL_Pos)          /*!< 0x00000010 */
#define ADC_CCTRL_ASISEL_Pos                (8U)
#define ADC_CCTRL_ASISEL_Msk                (0xFU << ADC_CCTRL_ASISEL_Pos)          /*!< 0x00000F00 */
#define ADC_CCTRL_ASISEL                    ADC_CCTRL_ASISEL_Msk                    /*!< ASISEL[3:0] bits Adjacent ADC sampling interval select for ordinary shifting mode */
#define ADC_CCTRL_ASISEL_0                  (0x1U << ADC_CCTRL_ASISEL_Pos)          /*!< 0x00000100 */
#define ADC_CCTRL_ASISEL_1                  (0x2U << ADC_CCTRL_ASISEL_Pos)          /*!< 0x00000200 */
#define ADC_CCTRL_ASISEL_2                  (0x4U << ADC_CCTRL_ASISEL_Pos)          /*!< 0x00000400 */
#define ADC_CCTRL_ASISEL_3                  (0x8U << ADC_CCTRL_ASISEL_Pos)          /*!< 0x00000800 */
#define ADC_CCTRL_MSDRCEN_Pos               (13U)
#define ADC_CCTRL_MSDRCEN_Msk               (0x1U << ADC_CCTRL_MSDRCEN_Pos)         /*!< 0x00002000 */
#define ADC_CCTRL_MSDRCEN                   ADC_CCTRL_MSDRCEN_Msk                   /*!< MSDRCEN bits Ordinary channel’s DMA request continuation enable for master slave mode */
#define ADC_CCTRL_MSDMASEL_Pos              (14U)
#define ADC_CCTRL_MSDMASEL_Msk              ((0x3U << ADC_CCTRL_MSDMASEL_Pos) | (0x1U << 28))        /*!< 0x00000F00 */
#define ADC_CCTRL_MSDMASEL                  ADC_CCTRL_MSDMASEL_Msk                  /*!< MSDMASEL[2:0] bits Adjacent ADC sampling interval select for ordinary shifting mode */
#define ADC_CCTRL_MSDMASEL_0                (0x1U << ADC_CCTRL_MSDMASEL_Pos)        /*!< 0x00000100 */
#define ADC_CCTRL_MSDMASEL_1                (0x2U << ADC_CCTRL_MSDMASEL_Pos)        /*!< 0x00000200 */
#define ADC_CCTRL_MSDMASEL_2                (0x1U << 28)                            /*!< 0x00000400 */

