ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
#define CAN_ESTS_TEC_Pos                    (16U)
#define CAN_ESTS_TEC_Msk                    (0xFFU << CAN_ESTS_TEC_Pos)             /*!< 0x00FF0000 */
#define CAN_ESTS_TEC                        CAN_ESTS_TEC_Msk                        /*!< Transmit error counter */
#define CAN_ESTS_REC_Pos                    (24U)
#define CAN_ESTS_REC_Msk                    (0xFFU << CAN_ESTS_REC_Pos)             /*!< 0xFF000000 */
#define CAN_ESTS_REC                        CAN_ESTS_REC_Msk                        /*!< Receive error counter */

/*******************  Bit definition for CAN_BTMG register  ********************/
#define CAN_BTMG_BRDIV_Pos                  (0U)
#define CAN_BTMG_BRDIV_Msk                  (0xFFFU << CAN_BTMG_BRDIV_Pos)          /*!< 0x00000FFF */
#define CAN_BTMG_BRDIV                      CAN_BTMG_BRDIV_Msk                      /*!< Baud rate division */

/*!< BTS1 congiguration */
#define CAN_BTMG_BTS1_Pos                   (16U)
#define CAN_BTMG_BTS1_Msk                   (0xFU << CAN_BTMG_BTS1_Pos)             /*!< 0x000F0000 */
#define CAN_BTMG_BTS1                       CAN_BTMG_BTS1_Msk                       /*!< BTS1[3:0] bits (Bit time segment 1) */
#define CAN_BTMG_BTS1_0                     (0x1U << CAN_BTMG_BTS1_Pos)             /*!< 0x00010000 */
#define CAN_BTMG_BTS1_1                     (0x2U << CAN_BTMG_BTS1_Pos)             /*!< 0x00020000 */
#define CAN_BTMG_BTS1_2                     (0x4U << CAN_BTMG_BTS1_Pos)             /*!< 0x00040000 */
#define CAN_BTMG_BTS1_3                     (0x8U << CAN_BTMG_BTS1_Pos)             /*!< 0x00080000 */

/*!< BTS2 congiguration */
#define CAN_BTMG_BTS2_Pos                   (20U)
#define CAN_BTMG_BTS2_Msk                   (0x7U << CAN_BTMG_BTS2_Pos)             /*!< 0x00700000 */
#define CAN_BTMG_BTS2                       CAN_BTMG_BTS2_Msk                       /*!< BTS2[2:0] bits (Bit time segment 2) */
#define CAN_BTMG_BTS2_0                     (0x1U << CAN_BTMG_BTS2_Pos)             /*!< 0x00100000 */
#define CAN_BTMG_BTS2_1                     (0x2U << CAN_BTMG_BTS2_Pos)             /*!< 0x00200000 */
#define CAN_BTMG_BTS2_2                     (0x4U << CAN_BTMG_BTS2_Pos)             /*!< 0x00400000 */

/*!< RSAW congiguration */
#define CAN_BTMG_RSAW_Pos                   (24U)
#define CAN_BTMG_RSAW_Msk                   (0x3U << CAN_BTMG_RSAW_Pos)             /*!< 0x03000000 */
#define CAN_BTMG_RSAW                       CAN_BTMG_RSAW_Msk                       /*!< RSAW[1:0] bits (Resynchronization width) */
#define CAN_BTMG_RSAW_0                     (0x1U << CAN_BTMG_RSAW_Pos)             /*!< 0x01000000 */
#define CAN_BTMG_RSAW_1                     (0x2U << CAN_BTMG_RSAW_Pos)             /*!< 0x02000000 */

#define CAN_BTMG_LBEN_Pos                   (30U)
#define CAN_BTMG_LBEN_Msk                   (0x1U << CAN_BTMG_LBEN_Pos)             /*!< 0x40000000 */
#define CAN_BTMG_LBEN                       CAN_BTMG_LBEN_Msk                       /*!< Loop back mode */
#define CAN_BTMG_LOEN_Pos                   (31U)
#define CAN_BTMG_LOEN_Msk                   (0x1U << CAN_BTMG_LOEN_Pos)             /*!< 0x80000000 */
#define CAN_BTMG_LOEN                       CAN_BTMG_LOEN_Msk                       /*!< Listen-Only mode */

/*!< Mailbox registers */
/*******************  Bit definition for CAN_TMI0 register  *******************/
#define CAN_TMI0_TMSR_Pos                   (0U)
#define CAN_TMI0_TMSR_Msk                   (0x1U << CAN_TMI0_TMSR_Pos)             /*!< 0x00000001 */
#define CAN_TMI0_TMSR                       CAN_TMI0_TMSR_Msk                       /*!< Transmit mailbox send request */
#define CAN_TMI0_TMFRSEL_Pos                (1U)
#define CAN_TMI0_TMFRSEL_Msk                (0x1U << CAN_TMI0_TMFRSEL_Pos)          /*!< 0x00000002 */
#define CAN_TMI0_TMFRSEL                    CAN_TMI0_TMFRSEL_Msk                    /*!< Transmit mailbox frame type select */
#define CAN_TMI0_TMIDSEL_Pos                (2U)
#define CAN_TMI0_TMIDSEL_Msk                (0x1U << CAN_TMI0_TMIDSEL_Pos)          /*!< 0x00000004 */
#define CAN_TMI0_TMIDSEL                    CAN_TMI0_TMIDSEL_Msk                    /*!< Transmit mailbox identifier type select */
#define CAN_TMI0_TMEID_Pos                  (3U)
#define CAN_TMI0_TMEID_Msk                  (0x3FFFFU << CAN_TMI0_TMEID_Pos)        /*!< 0x001FFFF8 */
#define CAN_TMI0_TMEID                      CAN_TMI0_TMEID_Msk                      /*!< Transmit mailbox extended identifier */
#define CAN_TMI0_TMSID_Pos                  (21U)
#define CAN_TMI0_TMSID_Msk                  (0x7FFU << CAN_TMI0_TMSID_Pos)          /*!< 0xFFE00000 */
#define CAN_TMI0_TMSID                      CAN_TMI0_TMSID_Msk                      /*!< Transmit mailbox standard identifier or extended identifier high bytes */

/*******************  Bit definition for CAN_TMC0 register  *******************/
#define CAN_TMC0_TMDTBL_Pos                 (0U)
#define CAN_TMC0_TMDTBL_Msk                 (0xFU << CAN_TMC0_TMDTBL_Pos)           /*!< 0x0000000F */
#define CAN_TMC0_TMDTBL                     CAN_TMC0_TMDTBL_Msk                     /*!< Transmit mailbox data byte length */
#define CAN_TMC0_TMTSTEN_Pos                (8U)
#define CAN_TMC0_TMTSTEN_Msk                (0x1U << CAN_TMC0_TMTSTEN_Pos)          /*!< 0x00000100 */
#define CAN_TMC0_TMTSTEN                    CAN_TMC0_TMTSTEN_Msk                    /*!< Transmit mailbox time stamp transmit enable */
#define CAN_TMC0_TMTS_Pos                   (16U)
#define CAN_TMC0_TMTS_Msk                   (0xFFFFU << CAN_TMC0_TMTS_Pos)          /*!< 0xFFFF0000 */
#define CAN_TMC0_TMTS                       CAN_TMC0_TMTS_Msk                       /*!< Transmit mailbox time stamp */

/******************  Bit definition for CAN_TMDTL0 register  ******************/
#define CAN_TMDTL0_TMDT0_Pos                (0U)
#define CAN_TMDTL0_TMDT0_Msk                (0xFFU << CAN_TMDTL0_TMDT0_Pos)         /*!< 0x000000FF */
#define CAN_TMDTL0_TMDT0                    CAN_TMDTL0_TMDT0_Msk                    /*!< Transmit mailbox data byte 0 */
#define CAN_TMDTL0_TMDT1_Pos                (8U)
#define CAN_TMDTL0_TMDT1_Msk                (0xFFU << CAN_TMDTL0_TMDT1_Pos)         /*!< 0x0000FF00 */
#define CAN_TMDTL0_TMDT1                    CAN_TMDTL0_TMDT1_Msk                    /*!< Transmit mailbox data byte 1 */
#define CAN_TMDTL0_TMDT2_Pos                (16U)
#define CAN_TMDTL0_TMDT2_Msk                (0xFFU << CAN_TMDTL0_TMDT2_Pos)         /*!< 0x00FF0000 */
#define CAN_TMDTL0_TMDT2                    CAN_TMDTL0_TMDT2_Msk                    /*!< Transmit mailbox data byte 2 */
#define CAN_TMDTL0_TMDT3_Pos                (24U)
#define CAN_TMDTL0_TMDT3_Msk                (0xFFU << CAN_TMDTL0_TMDT3_Pos)         /*!< 0xFF000000 */
#define CAN_TMDTL0_TMDT3                    CAN_TMDTL0_TMDT3_Msk                    /*!< Transmit mailbox data byte 3 */

/******************  Bit definition for CAN_TMDTH0 register  ******************/
#define CAN_TMDTH0_TMDT4_Pos                (0U)
#define CAN_TMDTH0_TMDT4_Msk                (0xFFU << CAN_TMDTH0_TMDT4_Pos)         /*!< 0x000000FF */
#define CAN_TMDTH0_TMDT4                    CAN_TMDTH0_TMDT4_Msk                    /*!< Transmit mailbox data byte 4 */
#define CAN_TMDTH0_TMDT5_Pos                (8U)
#define CAN_TMDTH0_TMDT5_Msk                (0xFFU << CAN_TMDTH0_TMDT5_Pos)         /*!< 0x0000FF00 */
#define CAN_TMDTH0_TMDT5                    CAN_TMDTH0_TMDT5_Msk                    /*!< Transmit mailbox data byte 5 */
#define CAN_TMDTH0_TMDT6_Pos                (16U)
#define CAN_TMDTH0_TMDT6_Msk                (0xFFU << CAN_TMDTH0_TMDT6_Pos)         /*!< 0x00FF0000 */
#define CAN_TMDTH0_TMDT6                    CAN_TMDTH0_TMDT6_Msk                    /*!< Transmit mailbox data byte 6 */
#define CAN_TMDTH0_TMDT7_Pos                (24U)
#define CAN_TMDTH0_TMDT7_Msk                (0xFFU << CAN_TMDTH0_TMDT7_Pos)         /*!< 0xFF000000 */
#define CAN_TMDTH0_TMDT7                    CAN_TMDTH0_TMDT7_Msk                    /*!< Transmit mailbox data byte 7 */

/*******************  Bit definition for CAN_TMI1 register  *******************/
#define CAN_TMI1_TMSR_Pos                   (0U)
#define CAN_TMI1_TMSR_Msk                   (0x1U << CAN_TMI1_TMSR_Pos)             /*!< 0x00000001 */
#define CAN_TMI1_TMSR                       CAN_TMI1_TMSR_Msk                       /*!< Transmit mailbox send request */
#define CAN_TMI1_TMFRSEL_Pos                (1U)
#define CAN_TMI1_TMFRSEL_Msk                (0x1U << CAN_TMI1_TMFRSEL_Pos)          /*!< 0x00000002 */
#define CAN_TMI1_TMFRSEL                    CAN_TMI1_TMFRSEL_Msk                    /*!< Transmit mailbox frame type select */
#define CAN_TMI1_TMIDSEL_Pos                (2U)
#define CAN_TMI1_TMIDSEL_Msk                (0x1U << CAN_TMI1_TMIDSEL_Pos)          /*!< 0x00000004 */
#define CAN_TMI1_TMIDSEL                    CAN_TMI1_TMIDSEL_Msk                    /*!< Transmit mailbox identifier type select */
#define CAN_TMI1_TMEID_Pos                  (3U)
#define CAN_TMI1_TMEID_Msk                  (0x3FFFFU << CAN_TMI1_TMEID_Pos)        /*!< 0x001FFFF8 */
#define CAN_TMI1_TMEID                      CAN_TMI1_TMEID_Msk                      /*!< Transmit mailbox extended identifier */
#define CAN_TMI1_TMSID_Pos                  (21U)
#define CAN_TMI1_TMSID_Msk                  (0x7FFU << CAN_TMI1_TMSID_Pos)          /*!< 0xFFE00000 */
#define CAN_TMI1_TMSID                      CAN_TMI1_TMSID_Msk                      /*!< Transmit mailbox standard identifier or extended identifier high bytes */

