ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437cx.h
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_SERIAL  0x00000000U                             /*!< Serial mode (1-1-1) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_DUAL    0x00000100U                             /*!< Dual-wire mode (1-1-2) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_QUAD    0x00000200U                             /*!< Quad mode (1-1-4) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_DUALIO  0x00000300U                             /*!< Dual-wire I/O mode (1-2-2) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_QUADIO  0x00000400U                             /*!< Quad I/O mode (1-4-4) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_DPI     0x00000500U                             /*!< DPI mode (2-2-2) */
#define QSPI_XIP_CMD_W1_XIPW_OPMODE_QPI     0x00000600U                             /*!< QPI mode (4-4-4) */

#define QSPI_XIP_CMD_W1_XIPW_ADRLEN_Pos     (11U)                                   /*!< 0x00000800 */
#define QSPI_XIP_CMD_W1_XIPW_ADRLEN_Msk     (0x1U << QSPI_XIP_CMD_W1_XIPW_ADRLEN_Pos)
#define QSPI_XIP_CMD_W1_XIPW_ADRLEN         QSPI_XIP_CMD_W1_XIPW_ADRLEN_Msk         /*!< XIP write address length */
#define QSPI_XIP_CMD_W1_XIPW_INSC_Pos       (12U)                                   /*!< 0x000FF000 */
#define QSPI_XIP_CMD_W1_XIPW_INSC_Msk       (0xFFU << QSPI_XIP_CMD_W1_XIPW_INSC_Pos)
#define QSPI_XIP_CMD_W1_XIPW_INSC           QSPI_XIP_CMD_W1_XIPW_INSC_Msk           /*!< XIP write instruction code */

/***************  Bit definition for QSPI_XIP_CMD_W2 register  ****************/
#define QSPI_XIP_CMD_W2_XIPR_DCNT_Pos       (0U)                                    /*!< 0x0000003F */
#define QSPI_XIP_CMD_W2_XIPR_DCNT_Msk       (0x3FU << QSPI_XIP_CMD_W2_XIPR_DCNT_Pos)
#define QSPI_XIP_CMD_W2_XIPR_DCNT           QSPI_XIP_CMD_W2_XIPR_DCNT_Msk           /*!< Indicates the time counter to judge maximum data count in mode D */
#define QSPI_XIP_CMD_W2_XIPR_TCNT_Pos       (8U)                                    /*!< 0x00007F00 */
#define QSPI_XIP_CMD_W2_XIPR_TCNT_Msk       (0x7FU << QSPI_XIP_CMD_W2_XIPR_TCNT_Pos)
#define QSPI_XIP_CMD_W2_XIPR_TCNT           QSPI_XIP_CMD_W2_XIPR_TCNT_Msk           /*!< Indicates the time counter to judge time interval in mode T */
#define QSPI_XIP_CMD_W2_XIPR_SEL_Pos        (15U)
#define QSPI_XIP_CMD_W2_XIPR_SEL_Msk        (0x1U << QSPI_XIP_CMD_W2_XIPR_SEL_Pos)  /*!< 0x00008000 */
#define QSPI_XIP_CMD_W2_XIPR_SEL            QSPI_XIP_CMD_W2_XIPR_SEL_Msk            /*!< XIP read mode select */
#define QSPI_XIP_CMD_W2_XIPW_DCNT_Pos       (16U)                                   /*!< 0x003F0000 */
#define QSPI_XIP_CMD_W2_XIPW_DCNT_Msk       (0x3FU << QSPI_XIP_CMD_W2_XIPW_DCNT_Pos)
#define QSPI_XIP_CMD_W2_XIPW_DCNT           QSPI_XIP_CMD_W2_XIPW_DCNT_Msk           /*!< Indicates the time counter to judge maximum data count in mode D */
#define QSPI_XIP_CMD_W2_XIPW_TCNT_Pos       (24U)                                   /*!< 0x7F000000 */
#define QSPI_XIP_CMD_W2_XIPW_TCNT_Msk       (0x7FU << QSPI_XIP_CMD_W2_XIPW_TCNT_Pos)
#define QSPI_XIP_CMD_W2_XIPW_TCNT           QSPI_XIP_CMD_W2_XIPW_TCNT_Msk           /*!< Indicates the time counter to judge time interval in mode T */
#define QSPI_XIP_CMD_W2_XIPW_SEL_Pos        (31U)
#define QSPI_XIP_CMD_W2_XIPW_SEL_Msk        (0x1U << QSPI_XIP_CMD_W2_XIPW_SEL_Pos)  /*!< 0x80000000 */
#define QSPI_XIP_CMD_W2_XIPW_SEL            QSPI_XIP_CMD_W2_XIPW_SEL_Msk            /*!< XIP write mode select */

/***************  Bit definition for QSPI_XIP_CMD_W3 register  ****************/
#define QSPI_XIP_CMD_W3_BYPASSC_Pos         (0U)
#define QSPI_XIP_CMD_W3_BYPASSC_Msk         (0x1U << QSPI_XIP_CMD_W3_BYPASSC_Pos)   /*!< 0x00000001 */
#define QSPI_XIP_CMD_W3_BYPASSC             QSPI_XIP_CMD_W3_BYPASSC_Msk             /*!< Bypass cache function */
#define QSPI_XIP_CMD_W3_CSTS_Pos            (3U)
#define QSPI_XIP_CMD_W3_CSTS_Msk            (0x1U << QSPI_XIP_CMD_W3_CSTS_Pos)      /*!< 0x00000008 */
#define QSPI_XIP_CMD_W3_CSTS                QSPI_XIP_CMD_W3_CSTS_Msk                /*!< Cache status */

/******************  Bit definition for QSPI_CTRL3 register  ******************/
#define QSPI_CTRL3_ISPC_Pos                 (8U)
#define QSPI_CTRL3_ISPC_Msk                 (0x1U << QSPI_CTRL3_ISPC_Pos)           /*!< 0x00000100 */
#define QSPI_CTRL3_ISPC                     QSPI_CTRL3_ISPC_Msk                     /*!< ISPC */

/*******************  Bit definition for QSPI_REV register  *******************/
#define QSPI_REV_REV_Pos                    (0U)
#define QSPI_REV_REV_Msk                    (0xFFFFFFFFU << QSPI_REV_REV_Pos)       /*!< 0xFFFFFFFF */
#define QSPI_REV_REV                        QSPI_REV_REV_Msk                        /*!< Indicates IP version */

/*******************  Bit definition for QSPI_DT register  ********************/
#define QSPI_DT_DT_Pos                      (0U)
#define QSPI_DT_DT_Msk                      (0xFFFFFFFFU << QSPI_DT_DT_Pos)         /*!< 0xFFFFFFFF */
#define QSPI_DT_DT                          QSPI_DT_DT_Msk                          /*!< Data port register */

/******************************************************************************/
/*                                                                            */
/*                         SDIO interface(SDIO)                               */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for SDIO_PWRCTRL register  *****************/
/*!< PS congiguration */
#define SDIO_PWRCTRL_PS_Pos                 (0U)
#define SDIO_PWRCTRL_PS_Msk                 (0x3U << SDIO_PWRCTRL_PS_Pos)           /*!< 0x00000003 */
#define SDIO_PWRCTRL_PS                     SDIO_PWRCTRL_PS_Msk                     /*!< PS[1:0] bits (Power switch) */
#define SDIO_PWRCTRL_PS_0                   (0x1U << SDIO_PWRCTRL_PS_Pos)           /*!< 0x00000001 */
#define SDIO_PWRCTRL_PS_1                   (0x2U << SDIO_PWRCTRL_PS_Pos)           /*!< 0x00000002 */

/*****************  Bit definition for SDIO_CLKCTRL register  *****************/
#define SDIO_CLKCTRL_CLKDIV_Msk             ((0xFFU << 0) | (0x3U << 15))           /*!< 0x000180FF */
#define SDIO_CLKCTRL_CLKDIV                 SDIO_CLKCTRL_CLKDIV_Msk                 /*!< CLKDIV[9:0] bits (Clock division) */
#define SDIO_CLKCTRL_CLKOEN_Pos             (8U)
#define SDIO_CLKCTRL_CLKOEN_Msk             (0x1U << SDIO_CLKCTRL_CLKOEN_Pos)       /*!< 0x00000100 */
#define SDIO_CLKCTRL_CLKOEN                 SDIO_CLKCTRL_CLKOEN_Msk                 /*!< Clock output enable */
#define SDIO_CLKCTRL_PWRSVEN_Pos            (9U)
#define SDIO_CLKCTRL_PWRSVEN_Msk            (0x1U << SDIO_CLKCTRL_PWRSVEN_Pos)      /*!< 0x00000200 */
#define SDIO_CLKCTRL_PWRSVEN                SDIO_CLKCTRL_PWRSVEN_Msk                /*!< Power saving mode enable */
#define SDIO_CLKCTRL_BYPSEN_Pos             (10U)
#define SDIO_CLKCTRL_BYPSEN_Msk             (0x1U << SDIO_CLKCTRL_BYPSEN_Pos)       /*!< 0x00000400 */
#define SDIO_CLKCTRL_BYPSEN                 SDIO_CLKCTRL_BYPSEN_Msk                 /*!< Clock divider bypass enable bit */

/*!< BUSWS congiguration */
#define SDIO_CLKCTRL_BUSWS_Pos              (11U)
#define SDIO_CLKCTRL_BUSWS_Msk              (0x3U << SDIO_CLKCTRL_BUSWS_Pos)        /*!< 0x00001800 */
#define SDIO_CLKCTRL_BUSWS                  SDIO_CLKCTRL_BUSWS_Msk                  /*!< BUSWS[1:0] bits (Bus width selection) */
#define SDIO_CLKCTRL_BUSWS_0                (0x1U << SDIO_CLKCTRL_BUSWS_Pos)        /*!< 0x00000800 */
#define SDIO_CLKCTRL_BUSWS_1                (0x2U << SDIO_CLKCTRL_BUSWS_Pos)        /*!< 0x00001000 */

#define SDIO_CLKCTRL_CLKEGS_Pos             (13U)
#define SDIO_CLKCTRL_CLKEGS_Msk             (0x1U << SDIO_CLKCTRL_CLKEGS_Pos)       /*!< 0x00002000 */
#define SDIO_CLKCTRL_CLKEGS                 SDIO_CLKCTRL_CLKEGS_Msk                 /*!< SDIO_CK edge selection */
#define SDIO_CLKCTRL_HFCEN_Pos              (14U)
#define SDIO_CLKCTRL_HFCEN_Msk              (0x1U << SDIO_CLKCTRL_HFCEN_Pos)        /*!< 0x00004000 */
#define SDIO_CLKCTRL_HFCEN                  SDIO_CLKCTRL_HFCEN_Msk                  /*!< Hardware flow control enable */

